<HTML>
<HEAD>
<TITLE> La Inteligencia artificial </TITLE>
</HEAD>
<BODY bgcolor="#B4F8B7 ">
   
    <blockquote><CENTER><IMG src="https://revistadigital.mx/wp-content/uploads/2023/02/Depositphotos_51226785_L.gif"
        width="1200" height="600"></CENTER></blockquote>
    
    <P><blockquote>
    <I><B><H2>Indice</H2></B></I>
    <A href="#La inteligencia artificial"><b>1.La inteligencia artificial</b></A><br>
    <br>
    <A href="#Cómo funciona la inteligencia artificial"><b>2.¿C&oacute;mo funciona la inteligencia artificial?</b></A><br>
    <br>
    <A href="#Tipos de inteligencia artificial"><b>3.Tipos de inteligencia artificial</b></A><br>
    <br>
    <A href="#Ventajas y desventajas de la inteligencia artificial"><b>4.Ventajas y desventajas de la inteligencia artificial</b></A><br>
    <br>
    <A href="#Historia de la inteligencia artificial"><b>5.Historia de la inteligencia artificial</b></A><br>
    <br>
    <A href="#Caracteristicas de la inteligencia artificial"><b>6.Caracteristicas de la inteligencia artificial</b></A><br>
    <br>
    <A href="#Leyes de la robotica"><b>7.Leyes de la robotica</b></A><br>
    <br>
    <A href="#Ejemplos de la IA en nuestro dia a dia"><b>8.Ejemplos de la IA en nuestro d&iacute;a a d&iacute;a</b></A><br>
    <br>
    <A href="#Algoritmos de la IA"><b>9.Algoritmos de la IA</b></A><br>
    <br>
    <A href="#IA en el los videojuegos"><b>10.IA en el los videojuegos</b></A><br>
    <br>
    <A href="#El papel de la inteligencia artificial en la lucha contra el cambio climático"><b>11.El papel de la inteligencia artificial en la lucha contra el cambio clim&aacute;tico</b></A><br>
    <br>
    <A href="#Qué has aprendido"><b>12.¿Qu&eacute; has aprendido ?</b></A><br>
    <br>

    <p><blockquote><b>Paginas Extras</b></blockquote></p>

    <a href="file:///D:/Web/PRINCIPALES%20APLICACIONES.html"><b>Las principales aplicaciones de la inteligencia artificial</b></a><br>
    <br>
    <A href="file:///D:/Web/POSIBLES%20DA%C3%91OS.html"><b>PELIGROS</b></A><br>
    <br>
    <a href="file:///D:/Web/Cosas%20que%20no%20sabias%20de%20la%20IA.html"><b>M&aacute;s datos sobre la IA</b></a><br>
    <br>
   
    </P></blockquote>

        <ul>  
        <p><blockquote><center><b><h2>&#191;Qu&eacute; sabes sobre la inteligencia artificial?</h2></b></center></blockquote></p>
        <br>
        </ul>
   
        <center><p><blockquote>
            <FORM ACTION="mailto:justin.ortiz3677@alumnos.udg.mx" METHOD="POST" ENCTYPE="TEXT/PLAIN">
               <p>Escribe tu apellido:</p>
               <BR>
               <INPUT TYPE="text" NAME="Apellido" SIZE="15" MAXLENGTH="12"><br>
               <br>

               <p>Escribe tu nombre:</p>
               <BR>
               <INPUT TYPE="text" NAME="Nombre" SIZE="15" MAXLENGTH="12"><br>
               <br>

               <P>&#191;Cu&aacute;l es tu correo electronico?</P>
               <INPUT TYPE="text" NAME="Correo electronico" SIZE="15" MAXLENGTH="40"><br>

               <p>&#191;Para t&iacute; que es la inteligencia artificia?</p>
               <textarea NAME="Que es?" ROWS="6" COLS="40"></textarea><br>

               <p>&#191;Consideras que la inteligencia artificia es importante?&#191;porque?</p>
               <textarea NAME="Porque es importante?" ROWS="6" COLS="40"></textarea><br>

               <p>&#191;Cu&aacute;l de estas inteligencias artificiales has usado o usas mas en tu vida cotidiana?</p>
               <SELECT NAME="IA de mayor uso" >
                   <OPTION SELECTED>
                   <OPTION>ChatGpt
                   <OPTION>Smartphones
                   <OPTION>GPS
                   <OPTION>Siri
                   <option>Alexa
                   <option>Google Assistant
                   </SELECT>
   
               <input type="submit" value="enviar mensaje>">
           </FORM>
        </blockquote></p></center>

        <center><MAP NAME="CHATGPT">
            <AREA SHAPE="RECT" COORDS="12,10,326,210" HREF="https://humanidades.com/tecnologia/">
            <AREA SHAPE="poly" COORDS="471,303,635,17,336,19,347,28" HREF="https://www.genbeta.com/a-fondo/chatgpt-guia-a-fondo-que-como-usarlo-mejor-que-puedes-hacer-este-chat-conversacional-ia">
            <AREA SHAPE="circle" COORDS="159,306,92" HREF="https://www.lth.com.mx/experiencia-LTH/blog/inteligencia-artificial-en-los-coches">
            <AREA SHAPE="DEFAULT" NOHREF>
            </MAP>
            <IMG SRC="https://i.pinimg.com/originals/7a/9f/bb/7a9fbba50ca0f76593130336f5ff9092.gif" USEMAP="#CHATGPT"></center>

    <H1 id="La inteligencia artificial"> <CENTER> La inteligencia artificial </CENTER> </H1>
<HR>

<p> <blockquote> La inteligencia artificial aprovecha las computadoras y las m&aacute;quinas para imitar las capacidades de resoluci&oacute;n
        de problemas y toma de decisiones de la mente humana.<BR> 
        Aunque durante las &uacute;ltimas d&eacute;cadas ha surgido una serie de definiciones de la inteligencia artificial (IA),<A HREF="https://es.wikipedia.org/wiki/John_McCarthy_(cient%C3%ADfico)">John McCarthy</A>
        ofrece la siguiente en este art&iacute;culo  publicado en 2004 (PDF, 127 KB) (enlace externo a IBM): "Es la ciencia y la ingenier&iacute;
        a de la fabricaci&oacute;n de m&aacute;quinas inteligentes, especialmente programas inform&aacute;ticos inteligentes. 
        Est&aacute; relacionada con la tarea similar de usar computadoras para entender la inteligencia humana,pero la IA no tiene que limitarse
        a m&eacute;todos que son biol&oacute;gicamente observables".<BR>
        <BR>

        Sin embargo, d&eacute;cadas antes de esta definici&oacute;n, la conversaci&oacute;n sobre la inteligencia artificial se inici&oacute; con 
        el trabajo trascendental de <A href="https://www.biografiasyvidas.com/biografia/t/turing.htm">Alan Turing</A>, <A href="https://academic.oup.com/mind/article/LIX/236/433/986238">"Computing Machinery and Intelligence"</A> (PDF, 89,8 KB) (enlace externo a IBM), que se public&oacute;
        en 1950. En este art&iacute;culo, Turing, al que muchos conocen como el "padre de la inform&aacute;tica", hace la siguiente pregunta: 
        "&#191;Pueden pensar las m&aacute;quinas?" Partiendo de esa idea, ofrece una prueba, hoy conocida como la "Prueba de Turing", en la que 
        un evaluador humano intenta distinguir entre la respuesta textual de una computadora y la de un ser humano.<BR>
        <BR>

        Si bien esta prueba ha sido objeto de mucho escrutinio desde su publicaci&oacute;n, sigue siendo una parte importante de la historia de
        la IA, as&iacute; como un concepto en curso dentro de la filosof&iacute;a, ya que utiliza ideas en torno a la ling&uuml;&iacute;stica. 
        <A href="https://es.wikipedia.org/wiki/Stuart_J._Russell">Stuart Russell</A> y <A HREF="https://es.wikipedia.org/wiki/Peter_Norvig">Peter Norvig</A>
        procedieron entonces a publicar "Artificial Intelligence: A Modern Approach" (enlace externo a IBM), 
        convirti&eacute;ndose en uno de los principales libros de texto en el estudio de la IA. En &eacute;l profundizan en cuatro posibles objetivos o definiciones de la IA, 
        que se diferencia de los sistemas inform&aacute;ticos sobre la base de la racionalidad y el pensamiento frente a la acci&oacute;n:<BR>
        <br>
    <UL>
        <LI><b>Enfoque humano:</b><BR>
        Sistemas que piensan como los humanos<BR>
        Sistemas que act&uacute;an como los humanos<BR>
        <BR>

        <LI><b>Enfoque ideal:</b><BR>
        
        Sistemas que piensan racionalmente<BR>
        Sistemas que act&uacute;an racionalmente<BR>
        <BR>
    </UL>
        
        La definici&oacute;n de <A href="https://www.biografiasyvidas.com/biografia/t/turing.htm">Alan Turing</A> entrar&iacute;a en la categor&iacute;a de "sistemas 
        que act&uacute;an como los humanos".<BR>
        <BR>
        En su forma m&aacute;s simple, la inteligencia artificial es un campo que combina la ciencia inform&aacute;tica y los conjuntos de datos
        robustos para permitir la resoluci&oacute;n de problemas. Tambi&eacute;n abarca los subcampos del machine learning y el deep learning, 
        que se mencionan frecuentemente junto con la inteligencia artificial. Estas disciplinas est&aacute;n conformadas por algoritmos de IA que 
        buscan crear sistemas expertos que hagan predicciones o clasificaciones basadas en datos de entrada.<BR>
        <BR>

        Hoy en d&iacute;a, todav&iacute;a hay mucho bombo publicitario en torno al desarrollo de la IA, lo que se espera de cualquier nueva 
        tecnolog&iacute;a emergente en el mercado.<BR>
        <BR>

        Como se se&ntilde;al&oacute; en El ciclo de exageraciones de Gartner (el enlace reside fuera de IBM), las innovaciones de productos, como los 
        autom&oacute;viles aut&oacute;nomos y los asistentes personales, siguen "una progresi&oacute;n t&iacute;pica de innovaci&oacute;n, 
        desde el entusiasmo excesivo a trav&eacute;s de un per&iacute;odo de desilusi&oacute;n hasta una comprensi&oacute;n final de la 
        relevancia y el papel de la innovaci&oacute;n en un mercado o dominio. "<BR>
        <BR>

        Como menciona <A HREF="https://es.wikipedia.org/wiki/Lex_Fridman ">Lex Fridman</A> aqu&iacute; (01:08:15) (enlace externo a IBM) en la conferencia que dio en 
        el MIT en 2019, estamos en el punto m&aacute;ximo de las expectativas exageradas, acerc&aacute;ndonos al punto m&aacute;s bajo, la desilusi&oacute;n.<BR>
            <br>
</blockquote>
    
</p>
    <CENTER><IMG src="https://blog.growthinstitute.com/hubfs/untitled-4.gif" 
        width="900" height="600"></CENTER>
    
    <H2 id="Cómo funciona la inteligencia artificial"> <CENTER><h2> &#191;C&oacute;mo funciona la inteligencia artificial? </h2></CENTER> </H2>
<HR>
   
<p> <blockquote> 
        <b>&#191; Qu&eacute; funciones tiene la inteligencia artificial?</b><BR>
        Funciones de la inteligencia artificial abogado especialista Pablo Maza La capacidad de que las m&aacute;quinas piensen y razonen por su cuenta 
        puede ser el avance m&aacute;s importante de la tecnolog&iacute;a en los &uacute;ltimos siglos, pero tambi&eacute;n representa un 
        peligro real para la Humanidad. Como ya explico en el apartado de qu&eacute; es la inteligencia artificial, aqu&iacute; quiero ampliar informaci&oacute;n
        sobre las funciones de la inteligencia artificial.<BR>
        <BR>

        Las m&aacute;quinas que utilizan la inteligencia artificial tienen la capacidad de aprender, razonar, tomar decisiones y formar cierta 
        idea de la realidad, tal como pasa con los humanos.<BR>
        Su desarrollo se apoya en varias tecnolog&iacute;as y, dependiendo del uso que se le quiere dar y el tipo de mercado al que apunta, se generan 
        funcionalidades distintas entre los diferentes motores.<BR>
        <BR>

        Como abogado de inteligencia artificial he resumido las principales funciones. Debe aclararse que pese a los avances, no hay hasta el 
        momento un motor de Inteligencia Artificial que haya conseguido hacer todas las tareas que desempe&ntilde;a un humano, pues por lo general se 
        especializan y entrenan para que se sepan desarrollar con mucha certeza en un ramo en espec&iacute;fico.<BR>
        <BR>

        Hay Inteligencia Artificial en bots conversacionales, en la industria automotriz, rob&oacute;tica, ciberseguridad, en herramientas de 
        Business Intelligence y de Internet de las Cosas (IoT), as&iacute; como en los mercados de salud, comercio, seguros, finanzas.<BR>
        <BR>

        Los asistentes virtuales, una herramienta que va a sustituir muchos puestos de trabajos en oficinas, son la herramienta m&aacute;s com&uacute;n
        en la que se aplica la inteligencia artificial.<br>
        Los asistentes virtuales se utilizan en los sectores de la banca, por ejemplo, pero tambi&eacute;n est&aacute;n en Facebook y las 
        dem&aacute;s redes sociales. Se utilizan para indicar a una persona el procedimiento para contratar un seguro o una tarjeta de 
        cr&eacute;dito, por ejemplo. Muchas empresas han acudido a estas herramientas para dar servicio a sus empleados, sobre cuestiones de 
        vacaciones, pagos de horas extras entre otras.<BR>
        <BR>

        <b>&#191;C&oacute;mo mejora la inteligencia artificial?</b><BR>
        El desarrollo de la Inteligencia Artificial aumenta gracias al uso de soluciones de Deep Learning y Machine Learning, y al uso creciente
        uso de tecnolog&iacute;a de Capsule Networks  para el procesamiento de informaci&oacute;n visual.<BR>
</blockquote></p>

    <CENTER> <IMG src="https://vidatech.pe/wp-content/uploads/2019/06/inteligencia-artificial-en-la-ciberseguridad-1000-x-450.png" 
        width="900" height="700"></CENTER><br>
    <br>

    <center><a href="file:///D:/Web/PRINCIPALES%20APLICACIONES.html"><b> Las principales aplicaciones de la inteligencia artificial </b></a></center>

    
    <H3 id="Tipos de inteligencia artificial"> <CENTER><h2>Tipos de inteligencia artificial</h2> </CENTER> </H3>
<HR>
    
<p> <blockquote> A diferencia de lo que estamos acostumbrados a ver en las pel&iacute;culas, los diferentes tipos de inteligencia artificial no son tan
        ut&oacute;picas y ya est&aacute;n con nosotros. 
        &#161;No te preocupes, ning&uacute;n robot se rebelar&aacute; contra la humanidad!, Realmente, esa tecnolog&iacute;a solo nos ha ayudado a ejecutar 
        los procesos m&aacute;s sofisticados, especialmente en Marketing Digital.<BR>
        <BR>

        La automatizaci&oacute;n es una de las principales ganancias obtenidas con la inteligencia artificial y, despu&eacute;s de eso, todo ha cambiado en el
         marketing. Como resultado de la transformaci&oacute;n digital, esos diferentes mecanismos ayudan a las empresas a lograr resultados 
         sobresalientes, especialmente cuando se basan en datos.<BR>
        <BR>

        Mientras m&aacute;s sepamos sobre la inteligencia artificial, m&aacute;s podremos aprovecharla estrat&eacute;gicamente.
        A continuaci&oacute;n te mostraremos los diferentes tipos de inteligencia artificial y c&oacute;mo se aplican.

        <UL>
        <LI><b>Artificial Narrow Intelligence (ANI)</b><BR>
            <BR>

        <blockquote>
        ANI es un tipo de inteligencia artificial m&aacute;s inflexible, que no se amolda ni se adapta a los requisitos de un sistema o m&aacute;quina
        en particular. Su funci&oacute;n es centrarse en un trabajo &uacute;nico y dedicar toda su complejidad. Si trazamos un paralelo, ser&iacute;a 
        un profesional capacitado que se dedica a una &uacute;nica funci&oacute;n compleja.
        <BR>

        El funcionamiento del modelo ANI se proyecta a trav&eacute;s de la programaci&oacute;n de sus acciones. En esa etapa, debe estar preparada para actuar
        en un solo rol, reduciendo su desempe&ntilde;o tanto como sea posible. Esto tambi&eacute;n garantizar&aacute; que pueda desempe&ntilde;ar plenamente su papel. 
        Por m&aacute;s que eso parezca una limitaci&oacute;n, tambi&eacute;n puede verse como una dedicaci&oacute;n amplia e integral.<BR>
        <BR>

        Entre sus caracter&iacute;sticas, ANI es una inteligencia artificial con car&aacute;cter reactivo y memoria limitada. Adem&aacute;s, por
        definici&oacute;n, todos los dem&aacute;s modelos pueden considerarse un tipo de ANI. La diferencia es que, en su mayor parte, los tipos de 
        inteligencia artificial est&aacute;n dise&ntilde;ados para cumplir funciones m&aacute;s diversas e incluso m&uacute;ltiples.
        <BR>

        Las clasificaciones t&eacute;cnicas ubican al ANI como una inteligencia incapaz de reproducir el comportamiento humano, solo simul&aacute;ndolo. Por eso, 
        solo est&aacute; orientado a objetivos espec&iacute;ficos.<BR>
        <BR>
        </blockquote>

          <UL>Normalmente, ANI se utiliza en funciones como:
            <LI>Asistentes virtuales (Siri, Alexa, Cortana, entre otros);
            <LI>Reconocimiento facial;
            <LI>Filtros de spam en correos electr&oacute;nicos;
            <LI>Sistemas de veh&iacute;culos aut&oacute;nomos.
        </UL>
        <BR>

        <LI><b>Inteligencia Artificial General (AGI)</b><BR>
        <BR>
        <blockquote>

        Entre los tipos de inteligencia artificial, AGI se considera fuerte y profunda, como una m&aacute;quina capaz de imitar la inteligencia humana y con una vasta capacidad de acci&Oacute;n. 
        En su comportamiento, ella puede aprender y, con base en eso, replicar actitudes para resolver diferentes cuestiones. Eso es lo que la convierte en uno de los modelos m&aacute;s vers&aacute;tiles disponibles
        actualmente.<BR>
        <BR>
        
        AGI tiene el papel de pensar, lo que conduce a una comprensi&oacute;n &uacute;nica y no completamente rob&oacute;tica. As&iacute;, para
        cada escenario con el que tiene que lidiar, la soluci&oacute;n propuesta es diferente. Esa capacidad de adaptaci&oacute;n a diferentes 
        escenarios hace que tenga una actividad de resoluci&oacute;n muy cercana a la mente humana. Precisamente por eso ella es considerada una 
        inteligencia mucho m&aacute;s profunda.<BR>
    <BR>

        Una de las bases de AGI es su estructura te&oacute;rica. Eso significa que tiene la capacidad de evaluar y detectar diferentes necesidades, 
        procesos e incluso emociones para actuar correctamente. 
        Esa es una caracter&iacute;stica &uacute;nica cuando la comparamos con otros tipos de inteligencia artificial.<BR>
    <BR>

        En la pr&aacute;ctica, su capacidad de aprendizaje y su nivel cognitivo son muy altos. Eso permite, por ejemplo, moldear el servicio de una 
        empresa seg&uacute;n las dudas y necesidades m&aacute;s comunes de la persona de la marca.<BR>
        Es muy com&uacute;n trabajar con m&aacute;quinas que son capaces de replicar acciones humanas, lo que en s&iacute; mismo es muy beneficioso. 
        Sin embargo, AGI es un sistema capaz de estudiar y comprender a los humanos y lidiar de Manera precisa con las interacciones y 
        los comportamientos de los usuarios.<BR>
    <BR>
    </blockquote>

        <LI><b>Superinteligencia Artificial (ASI)</b><BR>
            <BR>
            <blockquote>
            El nombre est&aacute; a la altura de la capacidad de ese tipo de inteligencia artificial. ASI es considerada la m&aacute;s poderosa, precisamente
            porque es la m&aacute;quina capaz de volverse consciente y aut&oacute;noma.
            Es decir, en lugar de simplemente replicar el comportamiento humano, ASI supera esa capacidad. Incluso se la considera capaz de 
            pensar mejor y de ser m&aacute;s h&aacute;bil que nosotros.<BR>
            <BR>
            
            Por supuesto, esa es una categor&iacute;a de inteligencia artificial que a&uacute;n est&aacute; en desarrollo y mejora, aunque en un estado avanzado.
            &#161;Este es el modelo que ha inspirado al cine a crear realidades en las que los robots tienen voluntad propia y simplemente dominan
            la Tierra! Por supuesto que eso no suceder&aacute;, pero la idea es que puedan ser inteligentes de la misma manera que se los retrata 
            en las pel&iacute;culas.<BR>
            <BR>
            
            La l&iacute;nea de desarrollo de ASI se esfuerza para que esos robots puedan ser mejores que los humanos en absolutamente todo. 
            Las m&aacute;quinas ser&aacute;n mejores atletas, cient&iacute;ficos, artistas e incluso m&eacute;dicos. Realmente existe la posibilidad de
            pensar en eso porque es a un nivel cient&iacute;fico que se enfoca en crear sistemas que despierten emociones y deseos propios.<BR>
            As&iacute;, se necesita cuidado en el desarrollo de ASI. La capacidad de razonamiento avanzado requiere un an&aacute;lisis meticuloso de 
            las posibles consecuencias que eso puede tener.<BR> 
            Por eso, el trabajo es continuo, siempre realizado con responsabilidad.<BR>
            <BR>
            </blockquote>

            <LI><b>M&aacute;quinas reactivas</b><BR>
            <BR>

            <blockquote>
                Entre los tipos de inteligencia artificial, las m&aacute;quinas reactivas son las m&aacute;s simples y antiguas que se conocen. 
                Es un modelo introductorio y tiene una capacidad mucho m&aacute;s limitada que los modelos presentados hasta ahora. 
                Su funci&oacute;n es bastante simple: reproducir el comportamiento humano cuando es estimulado, o sea, solo una acci&oacute;n reactiva.<BR>
                <BR>
                
                Como no tienen memoria, esas m&aacute;quinas no tienen la capacidad de aprender y administrar una base de datos interna para ejecutar
                lo que absorben. As&iacute;, solo tienen un rol de respuesta, es decir, est&aacute;n automatizados para reaccionar ante alguna acci&oacute;n. 
                Esa limitaci&oacute;n, sin embargo, no impide que sean &uacute;tiles en varios textos, aunque poco a poco se van quedando obsoletas.<BR>
                <BR>
                
                Sin duda, cuando hablamos de m&aacute;quinas reactivas, debemos recordar su gran momento, cuando fueron probadas en la d&eacute;cada de 
                1990. Fue un sistema como ese el que venci&oacute; al campe&oacute;n de ajedrez Garry Kasparov en 1997. 
                En ese momento, la m&aacute;quina espec&iacute;fica era una creaci&oacute;n de IBM, llamada Deep Blue.<BR>
                <BR>
                </blockquote>
            
            <LI><b>Memoria Limitada</b><BR>
                <BR>

                <blockquote>
                Las m&aacute;quinas de memoria limitada son, como en el ejemplo anterior, completamente reactivas, pero con la ventaja de tener 
                una peque&ntilde;a cantidad de memoria disponible. 
                Eso las hace m&aacute;s avanzadas, ya que esa funci&oacute;n las permite aprender de los datos. Es decir, cada vez que se exponen a 
                informaci&oacute;n son capaces de generar aprendizajes a partir de ese contenido.<BR>
                <BR>
                
                Naturalmente, esas m&aacute;quinas crean peque&ntilde;as bases de datos a partir de su historial de interacciones. Es a partir de ah&iacute; que son capaces, 
                cuando es necesario, de tomar peque&ntilde;as decisiones para responder a una solicitud o realizar cualquier acci&oacute;n. Hoy en d&iacute;a, esa forma de 
                inteligencia artificial se usa ampliamente, pero solo en su base. Se ha ampliado la memoria para que funcione mejor.<BR>
                <BR>
                
                La base de la inteligencia de memoria limitada todav&iacute;a se usa y se puede ver hoy en los sistemas de reconocimiento facial, 
                asistentes virtuales y chatbots, por ejemplo.<BR>
                <BR>
                </blockquote>
            
            <LI><b>Teor&iacute;a de la Mente</b><BR>
                <BR>
                <blockquote>

                La Teor&iacute;a de la Mente es un tipo de inteligencia artificial en el que se ha trabajado mucho en los &uacute;ltimos a&ntilde;os. No podemos 
                decir mucho sobre su aplicaci&oacute;n y hasta d&oacute;nde llegar&aacute; en t&eacute;rminos de desarrollo, sin embargo, la idea es que ser&aacute; uno de los 
                modelos m&aacute;s innovadores jam&aacute;s vistos. La propuesta es que pueda comprender mejor las interacciones a las que est&aacute; expuesta.<BR>
                    <BR>
                
                As&iacute;, la Teor&iacute;a de la Mente trata precisamente de las emociones, necesidades y procesos de reflexi&oacute;n que presenta la mente humana.<BR>
                
                Actualmente, esa categor&iacute;a todav&iacute;a se ve como un futuro, incluso con todos los avances logrados en el segmento hasta ahora. 
                Los expertos entienden que todav&iacute;a se necesitan muchos avances y otras partes de los estudios de la inteligencia artificial.<BR>
                    <BR>
                
                Por eso, la Teor&iacute;a de la Mente es una idealizaci&oacute;n en ejecuci&oacute;n, pero tiene el potencial de ser uno de los modelos
                 m&aacute;s destacados. 
                El proceso, adem&aacute;s del desarrollo de estudios en general, tambi&eacute;n depende de la comprensi&oacute;n de los factores de la mente 
                humana que conducen a sentimientos y reacciones variadas.<BR>
                <BR>
                </blockquote>
            
            <LI><b>Autoconciencia</b><BR>
                <BR>
                <blockquote>
                La autoconciencia es solo una idea, es decir, un concepto que gu&iacute;a el desarrollo de la inteligencia artificial. Por ahora,
                todav&iacute;a no hay creaciones concretas, pero la idea es que, en el futuro, las m&aacute;quinas ser&aacute;n conscientes de s&iacute; mismas. Ese es 
                el nivel de desarrollo m&aacute;s alto que puede alcanzar la inteligencia artificial y, por supuesto, lleva tiempo y muchos esfuerzos.<BR>
                <BR>

                La idea es que esa inteligencia artificial pueda comprender todas las emociones, tener las suyas y comprender cada detalle que 
                pasa con quienes interact&uacute;an con ella. Por ambicioso que parezca es innegable que ese es el camino que los cient&iacute;ficos tienen 
                como horizonte. Sin embargo, no es posible se&ntilde;alar en cu&aacute;ntos a&ntilde;os la tecnolog&iacute;a podr&aacute; 
                alcanzar hasta ese nivel.<BR>
                <BR>
                
                Tambi&eacute;n es indudable que esa es una etapa peligrosa en el avance de la inteligencia artificial. Las m&aacute;quinas mayormente independientes 
                tendr&aacute;n un razonamiento que simplemente no se puede detener todo el tiempo. 
                Por eso, queda mucho por hacer, aunque la autoconciencia ya es una idea clara entre los tipos de inteligencia artificial.<BR>
                    <BR>
                
                La realidad actual de la tecnolog&iacute;a permite que las m&aacute;quinas act&uacute;en como seres humanos, lo que resulta de gran utilidad para las m&aacute;s 
                diversas soluciones del mercado. Ese es el camino para que llegan nuevos tipos de inteligencia artificial y cambien el mundo.<BR>
                <BR>
                </blockquote>
</UL>
</blockquote></p>
       
    <CENTER><IMG src="https://observatory.innova.games/wp-content/themes/heeney-child/assets/images/category-headers/cabecera_ia.gif" 
        width="1000" height="500"></CENTER>

    
        <H4 id="Ventajas y desventajas de la inteligencia artificial"> <CENTER><h2> Ventajas y desventajas de la inteligencia artificial</h2> </CENTER> </H4>
<HR>

    
<p> <blockquote><H3> Ventajas </H3><BR>
    <br>
        <UL>
        <LI><b>Automatizaci&oacute;n de procesos.</b><br>
        <blockquote>
        Permite que las m&aacute;quinas hagan de forma autom&aacute;tica tareas que para los humanos resultan repetitivas y tediosas.<BR>
        <BR>
        </blockquote>

        <LI><b>Reduce el error humano.</b><br>
        <blockquote>
        Al reducir la intervenci&oacute;n de los humanos en ciertos procesos, acaba con las posibilidades de que estos puedan cometer errores. 
        Por ejemplo, una errata al introducir un dato en la contabilidad de un negocio.<BR>
        <BR>
        </blockquote>

        <LI><b>Potencia la creatividad.</b><br>
        <blockquote>
        Al liberar a los trabajadores de tareas repetitivas y poco motivadoras, la mente de estos es mucho m&aacute;s libre para dedicarse al proceso creativo.<BR>
        <BR>
        </blockquote>

        <LI><b>Aporta precisi&oacute;n.</b><br>
        <blockquote>
        Al ser capaz de tomar decisiones por s&iacute; misma, la inteligencia artificial da lugar a procesos productivos mucho m&aacute;s eficientes y con una menor tasa de error.<BR> 
        <BR>
        </blockquote>

        <LI><b>Agiliza la toma de decisiones.</b><br>
        <blockquote>
        La inteligencia artificial es capaz de analizar miles de datos en apenas minutos y adem&aacute;s tener en cuenta posibles actualizaciones 
        de los mismos. La informaci&oacute;n bien sintetizada y actualizada ayuda a los profesionales a tomar decisiones estrat&eacute;gicas<BR>
        <br>
        </blockquote>
        </UL>

    </p></blockquote>
        
        <blockquote>
    
    <center><IMG src="https://brita.mx/wp-content/uploads/2020/10/Recomendacion-de-productos-con-IA.gif" 
        width="600" height="400" ALIGTN="RIGHT">
    
     <IMG src="https://cdn-images-1.medium.com/v2/resize:fit:854/1*SnO8X48_OH9diPwoqEPboQ.gif" 
            width="600" height="400" ALIGN="LEFT"></center>
        </blockquote>
        
        <P><blockquote><H3>Desventajas</H3><BR>
            <BR>

        <UL>
        <LI><b>Dificultad de acceso a los datos:</b><br>
        <blockquote>
        Para que una inteligencia artificial funcione de forma adecuada debe tener datos actualizados y fiables, pero esto nos siempre es as&iacute;.
        Por eso, uno de los principales retos a abordar es garantizar que estos sistemas puedan acceder a los datos que necesitan en cada momento.<BR>
        <BR>
        </blockquote>

        <LI><b>Falta de profesionales cualificados:</b><br>
        <blockquote>
        Uno de los inconvenientes de esta tecnolog&iacute;a es que su desarrollo no est&aacute; siendo tan r&aacute;pido como deber&iacute;a porque
        faltan profesionales bien cualificados que puedan implementar los ajustes necesarios.<BR>
        <BR>
        </blockquote>

        <LI><b>Su desarrollo es costoso:</b><br>
        <blockquote>
        Aunque las inteligencias artificiales aplicadas al &aacute;mbito de la medicina, la producci&oacute;n, la direcci&oacute;n de empresas, etc. pueden ser 
        muy &uacute;tiles, el desarrollo de las mismas tiene todav&iacute;a un coste muy elevado, lo que hace que no sean accesibles para todo el mundo.<BR>
        <br>
        </blockquote>

       <CENTER><A href="file:///D:/Web/POSIBLES%20DAÑOS.html"><b>PELIGROS</b></A></CENTER>

        </UL>
    </P></blockquote>

    <P><blockquote>Con la inteligencia artificial las ventajas y desventajas est&aacute;n ah&iacute; y toca valorar qu&eacute; pesa m&aacute;s. Teniendo en cuenta la manera en la 
        que pueden mejorar la forma de trabajar en sectores muy diferentes entre s&iacute;, a d&iacute;a de hoy est&aacute; claro que spriman m&aacute;s los beneficios 
        que los inconvenientes.<BR>
        <BR>

        Dado que tanto ahora como en el futuro ser&aacute;n necesarios los expertos en esta materia, este es buen momento para informarte sobre 
        nuestro M&aacute;ster Universitario en Inteligencia Artificial y formarte para trabajar en un sector que est&aacute; teniendo un gran desarrollo.<br>
        <br> 
</blockquote></P>

    <CENTER> <IMG SRC="https://www.becas-santander.com/content/dam/becasmicrosites/blog/ventajas-y-desventajas-de-la-inteligencia-artificial-1.jpg"  
        width="900" height="500"></CENTER>

    <H5 id="Historia de la inteligencia artificial"><center><h1> Historia de la inteligencia artificial</h1></center></H5>
    <Hr> 

<p><blockquote>
        En 1950, el matem&aacute;tico Alan Turing se hizo una pregunta: -&#191;Pueden pensar las m&aacute;quinas?-. De hecho, esta simple pregunta transformar&iacute;a
        el mundo. El art&iacute;c&uuml;lo de <A href="https://www.biografiasyvidas.com/biografia/t/turing.htm">Alan Turing</A> <A href="https://academic.oup.com/mind/article/LIX/236/433/986238">-Computing Machinery and Intelligence-</A> y el consiguiente <A href="https://www.becas-santander.com/es/blog/test-de-turing.html">Test de Turing-</A> sentaron las bases de 
        la inteligencia artificial, su visi&oacute;n y sus objetivos. De hecho, la inteligencia artificial pretende responder afirmativamente a la pregunta de Alan Turing. <BR>
        <BR>

        Su objetivo es replicar o simular la inteligencia humana en las m&aacute;quinas.Se trata de un objetivo ambicioso, que tambi&eacute;n plantea muchos 
        interrogantes y suscita el debate. Por ello, a&uacute;n no existe una definici&oacute;n &uacute;nica de inteligencia artificial.<BR>
        La descripci&oacute;n de -m&aacute;quinas inteligentes- no explica qu&eacute; es realmente la inteligencia artificial ni qu&eacute; hace que una m&aacute;quina sea 
        inteligente. En un intento de remediar este problema,<A href="https://es.wikipedia.org/wiki/Stuart_J._Russell">Stuart Russell</A> y <A HREF="https://es.wikipedia.org/wiki/Peter_Norvig">Peter Norvig</A> 
        publicaron el libro <A href="https://people.engr.tamu.edu/guni/csce421/files/AI_Russell_Norvig.pdf">Artificial Intelligence: A Modern Approach-.</A><BR>
        <BR>

        En ese libro, los dos expertos unifican sus trabajos sobre el tema de los agentes inteligentes en las m&aacute;quinas. Seg&uacute;n ellos, -la IA es 
        el estudio de los agentes que reciben percepciones del entorno y realizan acciones-.
        En su opini&oacute;n, cuatro enfoques distintos han definido hist&oacute;ricamente el campo de la inteligencia artificial: el pensamiento humano, 
        el pensamiento racional, la acci&oacute;n humana y la acci&oacute;n racional.<BR>
        <BR>

        Los dos primeros enfoques se refieren al razonamiento y al procesamiento del pensamiento, mientras que los otros dos se refieren al 
        comportamiento. En su libro, Norvig y Russell se centran principalmente en los agentes racionales capaces de actuar para conseguir el 
        mejor resultado.
        Por su parte, <A hRef="https://en.wikipedia.org/wiki/Patrick_Winston">Patrick Winston</A>, profesor de inteligencia artificial del MIT, define la IA como 
        -algoritmos activados por restricciones, expuestos por representaciones que soportan modelos que vinculan el pensamiento, la percepci&oacute;n y la acci&oacute;n-.<BR>
        Otra definici&oacute;n moderna describe la IA como -m&aacute;quinas que responden a simulaciones como los humanos, con capacidad de contemplaci&oacute;n, 
        juicio e intenci&oacute;n-. Estos sistemas son capaces de -tomar decisiones que normalmente requieren un nivel humano de conocimiento-. 
        Tienen tres cualidades que constituyen la esencia de la inteligencia artificial: intencionalidad, inteligencia y adaptabilidad.<BR>
        <BR>

        Estas diferentes definiciones pueden parecer abstractas y complejas. Sin embargo, ayudan a establecer la inteligencia artificial como 
        una ciencia inform&aacute;tica.
        En 2017, durante la Japan AI Experience, el CEO de DataRobot, <A href="https://vestrategicos.com/inteligencia-artificial-recursos-humanos/#:~:text=En%202017%2C%20el%20CEO%20de,que%20normalmente%20requieren%20inteligencia%20humana%E2%80%A6">Jeremy Achina</A>, dio su propia definici&oacute;n moderna y con un toque de humor de
        la IA : -La inteligencia artificial es un sistema inform&aacute;tico capaz de realizar tareas que normalmente requieren inteligencia 
        humana… muchos de estos sistemas de IA se basan en el Machine Learning, otros en el Deep Learning y otros en cosas muy aburridas como 
        las reglas-.
    </blockquote></p>

       
    <IMG SRC="https://www.nationalgeographic.com.es/medio/2019/06/16/1956-nace-el-termino-inteligencia-artificial_c1774ad6_2000x1266.jpg"
    width="800" height="500" ALIGN="RIGHT"><BR>
    <BR>

    <IMG SRC="https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Alan_Turing_%281912-1954%29_in_1936_at_Princeton_University.jpg/640px-Alan_Turing_%281912-1954%29_in_1936_at_Princeton_University.jpg"
     widht="800" height="500" ALIGN="LEFT"><BR>
    <BR>

    <IMG SRC="https://s3.amazonaws.com/thetech-production/images/web_photos/web/9077_patrick_winston_02.jpg?1563847196"
    width="800" height="500" ALIGN="RIGHT"><BR>
    <BR>
      
    <align="left"></align><IMG SRC="https://imageio.forbes.com/specials-images/imageserve/6203367c939b99b76a9de51a/Jeremy-Achin/0x0.jpg?format=jpg&crop=2424,1616,x0,y0,safe&width=960"
     width="800" height="500" ></ALIGN="LEFT"><BR>
    <BR>
    
    <center><a href="file:///D:/Web/Cosas%20que%20no%20sabias%20de%20la%20IA.html"> <b>Mas datos sobre la IA</b></a></center>
        </blockquote></P>

    <H6 id="Caracteristicas de la inteligencia artificial"><CENTER><h1>Caracteristicas de la inteligencia artificial</h1></CENTER></H6>
    <HR>

    <P><blockquote>
        Segun  <A href="https://niixer.com/index.php/2023/03/19/la-inteligencia-artificial-sus-diferentes-caracteristicas-funcionalidades-y-sus-aplicaciones-mas-reconocidas/">Niixer</A> estas son las caracteristicas de la inteligenci artificial:<BR>
        <UL>
        <L1><b>Imita la cognici&oacute;n humana:</b><BR> 
    <blockquote>
        La IA se caracteriza principalmente por la imitaci&oacute;n del pensamiento humano. Tiene su propio campo de an&aacute;lisis, conocido como computaci&oacute;n cognitiva. B&aacute;sicamente se inspira 
        en el reconocimiento de patrones, la miner&iacute;a de datos y el procesamiento del lenguaje natural para simular el cerebro humano.<BR>
        <BR>
    </blockquote>

        <L1><b>Automatiza los procesos:</b><BR>
    <blockquote>
        La automatizaci&oacute;n de tareas es una de las caracter&iacute;sticas m&aacute;s importantes de la inteligencia artificial. Esta tecnolog&iacute;a permite que m&aacute;quinas o programas realicen 
        actividades redundantes, prolongadas y agotadoras en lugar de individuos. Por cierto, gracias a la mezcla de la automatizaci&oacute;n rob&oacute;tica de procesos (RPA) y la IA, nace lo que se denomina 
        automatizaci&oacute;n inteligente. <BR>
        <BR>  
    </blockquote>

        <L1><b>Nunca descansa:</b><BR>
    <blockquote> 
        Otro rasgo que la caracteriza es su capacidad para funcionar las 24 horas del d&iacute;a, los 365 d&iacute;as del a&ntilde;o. La Inteligencia Artificial nunca descansa y por lo tanto nunca se detiene. 
        Esto permite que los programas competentes contin&uacute;en progresando sin interrupciones y a una gran velocidad, Adem&aacute;s, es especialmente imprescindible en ocupaciones que requieren personal 
        en permanente actividad y buen funcionamiento. <BR>
        <BR>
    </blockquote>

        <L1><b>Es precisa:</b><BR>
    <blockquote>
         La alta fiabilidad de la IA se debe a su enorme precisi&oacute;n en la ejecuci&oacute;n de tareas. La probabilidad de fracaso de tales programas es muy baja. Obviamente, dado que la inteligencia artificial
         es una representaci&oacute;n fiel de la construcci&oacute;n humana, el nivel de precisi&oacute;n depende completamente del dise&ntilde;o del programa. Sin embargo, estos sistemas tienden a cometer cada vez 
         menos errores, ya que son los propios errores los que permiten optimizar continuamente estos dise&ntilde;os.<BR>
        <BR>
    </blockquote>

        <L1><b>Gestiona gran cantidad de datos :</b><BR>
    <blockquote>
        Una caracter&iacute;stica importante de la inteligencia artificial es la capacidad de procesar grandes cantidades de informaci&oacute;n. Aqu&iacute; es donde entra en juego el Big Data. 
        Big Data se refiere a un volumen de datos tan grande que es imperativo implementar herramientas especializadas para acceder adecuadamente a esta porci&oacute;n de informaci&oacute;n. Y es 
        la IA la que se encarga de gestionar los datos que el <a href="https://www.iberdrola.com/innovacion/que-es-para-que-sirve-big-data">big data</a> pone a tu disposici&oacute;n. En pocas palabras, 
        los grandes datos son el combustible y la inteligencia artificial es el motor que lo hace funcionar. <BR>
        <BR>
    </blockquote>
      </UL>
        
      <CENTER><IMG SRC="https://static01.nyt.com/images/2018/10/19/business/19AIcover-illo/19AIcover-illo-superJumbo-v5.gif"
       width="1000" height="600" ></CENTER><BR>
        <BR>

    <CENTER><H7 id="Leyes de la robotica"><h2>Leyes de la robotica</h2></H7></CENTER>
    <HR>

        <p><blockquote>
            Las leyes de la rob&oacute;tica o de Asimov son un conjunto de leyes establecidas en 1942 por el escritor y profesor de qu&iacute;mica ruso (luego nacionalizado estadounidense) <A hREf="https://es.wikipedia.org/wiki/Isaac_Asimov">Isaac Asimov</A> 
            (1920 – 1992). En aquel momento, fueron reglas que ten&iacute;an como objetivo “disciplinar” a los robots, cuando tuvieran gran protagonismo en la vida social.<br>
            <br>

            Asimov fue un visionario absoluto, ya que en 1942 nadie o muy pocos pod&iacute;an imaginar un futuro en el que la inteligencia artificial y la rob&oacute;tica fueran clave para el desarrollo de los 
            pa&iacute;ses.<br>
            Gracias al imparable avance de la tecnolog&iacute;a, estas leyes han cobrado gran notoriedad en los &uacute;ltimos a&ntilde;os. Europa, de hecho, se ha visto en la obligaci&oacute;n de comenzar a 
            crear una normativa especial para intentar legislar la rapidez con que la inteligencia artificial est&aacute; penetrando en la sociedad.<br>
            <br>

            <table border cellpadding="10">
            <tr>
                <th bgcolor="#FFFF00">Leyes</th>
                <th bgcolor="#FFFF00">Funci&oacute;n</th><br>
            </tr>
            <tr>
                <td bgcolor="#FFFF00">Los robots deber&aacute;n tener un interruptor de emergencia</td>
                <td bgcolor="#CCCCCC">Con el objetivo de controlar cualquier situaci&oacute;n peligrosa, se busca que la actividad de las m&aacute;quinas pueda ser moderada 
                por los seres humanos.</td><br>
            </tr>
            <tr>    
                <td bgcolor="#FFFF00">Los robots no podr&aacute;n da&ntilde;ar a los seres humanos</td>
                <td bgcolor="#CCCCCC">Esta posible ley tiene completa relaci&oacute;n con lo establecido por Asimov hace 80 a&ntilde;os. La rob&oacute;tica siempre debe estar pensada para proteger 
                y ayudar a las personas.</td><br>
            </tr>
            <tr>
                <td bgcolor="#FFFF00">Los robots grandes deber&aacute;n tener un seguro obligatorio</td>
                <td bgcolor="#CCCCCC">L&oacute;gicamente, no todas las m&aacute;quinas tendr&aacute;n las mismas caracter&iacute;sticas. Es evidente que algunos robots ser&aacute;n m&aacute;s 
                peligrosos y es por eso que deber&aacute;n ser asegurados.</td>
            </tr>
            <tr>
                <td bgcolor="#FFFF00">Derechos y obligaciones para los robots</td>
                <TD bgcolor="#CCCCCC">Tambien inspirado en las leyes de Asimov, se est&aacute; pensando en un marco regulatorio que establezca obligaciones para las m&aacute;quinas.</TD>
            </tr>
            <tr>
                <td bgcolor="#FFFF00">Los robots deber&aacute;n pagar impuestos</td>
                <td bgcolor="#CCCCCC">Uno de los principales temores de la irrupci&oacute;n de los robots en la vida p&uacute;blica es que reemplacen a los seres humanos en su trabajo. La Uni&oacute;n Europea buscar&iacute;a que las m&aacute;quinas o 
                sus empleadores tributen a la seguridad social para subvencionar la ayuda que ser&iacute;a necesaria en caso de que millones de personas se queden sin empleo.</td>
            </tr>
            <tr>
                <td bgcolor="#FFFF00">Las m&aacute;quinas tributar&aacute;n a la seguridad social</td>
                <td bgcolor="#CCCCCC">Su entrada en el mercado laboral impactar&aacute; sobre la mano de obra de muchas empresas. Los robots deber&aacute;n pagar impuestos para subvencionar las ayudas de los desempleados.</td>
            </tr>
        </table>
        <br>
 
        Ambas tecnolog&iacute;as ya est&aacute;n cambiando el mundo y las cifras son la mejor muestra de ello: la consultora estadounidense Gartner estima que el mercado de la IA pueda llegar a representar 127.000 
        millones de d&oacute;lares en 2025, cifra muy superior a los 2.000 millones de 2015.<br>
        <br> 

        Estados Unidos y China se situar&aacute;n a la cabeza en inversiones. La consecuencia es que, seg&uacute;n el Fondo Monetario Internacional (FMI), la IA acabar&aacute; con 85 millones de puestos de trabajo 
        en cinco a&ntilde;os, pero a cambio crear&aacute; 97 millones.<br>
        <br>

        <center><img src="https://ignaciogavilan.com/wp-content/uploads/2022/03/responsible_robotics.jpg" width="800" height="500"></center>
        <br>

        </p></blockquote>

        <center><H8 id="Ejemplos de la IA en nuestro dia a dia"><h2> Ejemplos de la IA en nuestro d&iacute;a a d&iacute;a</h2></H8></center>
        <hr>

        <p><blockquote>
        <UL>
            <LI><H2> Asistentes de voz </H2> <br>
            <br>
            Un asistente de voz es un dispositivo que cuenta con un software especializado que le permite interactuar con los usuarios a trav&eacute;s de comandos de voz. Estos asistentes est&aacute;n dise&ntilde;ados 
            para llevar a cabo una amplia variedad de tareas, como responder preguntas, realizar b&uacute;squedas en internet, reproducir m&uacute;sica, programar recordatorios, entre otras cosas. <br>
             <br>

            Los asistentes de voz se activan usando comandos de voz espec&iacute;ficos, como "Hola, Siri" u "Ok, Google", y luego pueden ser controlados por la voz para realizar diferentes tareas. Algunos 
            ejemplos populares de asistentes de voz son Siri de Apple, Google Assistant y Alexa de Amazon.<br>
             <br>

             Los asistentes de voz utilizan la inteligencia artificial para entender y responder a las solicitudes del usuario. Para hacer esto, un asistente personal inteligente utiliza algoritmos de procesamiento
              del lenguaje natural (PNL) y bases de datos de informaci&oacute;n para comprender y analizar las solicitudes del usuario.<br>
             <br>

             Algo notable que debe recalcarse es que estos sistemas no solo son capaces de mantener una conversaci&oacute;n con los usuarios, sino que adem&aacute;s con cada interacci&oacute;n aprenden m&aacute;s y 
             expanden sus posibilidades.<br>
             <br>

             Asimismo, los asistentes de voz tambi&eacute;n pueden integrarse con otras aplicaciones y servicios para realizar tareas m&aacute;s complejas. Haciendo uso de IoT (Internet of Things) los asistentes de 
             voz pueden conectarse con otros dispositivos e intercambiar informaci&oacute;n para aumentar sus capacidades de respuesta.<br>
             <br>

             Asistentes de voz, asistentes digitales y bots conversacionales son t&eacute;rminos que a menudo se utilizan de manera intercambiable para referirse a sistemas que est&aacute;n dise&ntilde;ados para interactuar con los usuarios a trav&eacute;s del uso de la voz o el texto.<br>
            <br>

             Si bien cada uno de estos t&eacute;rminos tiene sus propias connotaciones y matices, comparten algunas similitudes fundamentales. La principal caracter&iacute;stica en com&uacute;n que comparten estas 
             tres tecnolog&iacute;as es que su funcionamiento est&aacute; principalmente enfocado en el procesamiento del lenguaje natural (PNL), ya sea hablado o escrito.<br>
             <br> 

             Todos ellos utilizan la inteligencia artificial para entender, analizar y aprender de las solicitudes del usuario. Adem&aacute;s, todos est&aacute;n dise&ntilde;ados para realizar tareas y responder 
             preguntas en nombre del usuario.<br>
             <br>

            <ul>
            <li><b>Usos de los asistentes de voz</b><br>
            <br>
            <UL>
            <LI><b>Atenci&oacute;n al cliente</b><BR>
                <BR>
                    <i>Resoluci&oacute;n de problemas:</i><BR>
                <blockquote>
                    Los asistentes de voz pueden ayudar a los clientes a resolver problemas t&eacute;cnicos o dar seguimiento a sus pedidos mediante el uso de bases de datos.<BR>
                    <BR>
                </blockquote>

                   <i> Respuesta a preguntas frecuentes:</i><BR>
                <blockquote>
                    Estos asistentes tienen la capacidad de proporcionar respuestas a preguntas frecuentes de los clientes de manera r&aacute;pida gracias a su base de datos y al aprendizaje adquirido en 
                    interacciones previas.<BR>
                    <BR>
                </blockquote>
                    
                <i>Atenci&oacute;n mediante llamadas telef&oacute;nicas:</i><BR>
                <blockquote>
                    Atrav&eacute;s de la integraci&oacute;n con servicios de telefon&iacute;a los asistentes de voz pueden recibir llamadas y proporcionar informaci&oacute;n b&aacute;sica a los clientes.<BR>
                    <BR>
                </blockquote>
            
            <LI><b>Oficinas Inteligentes</b><br>
                <br>

                <i>Control de dispositivos de automatizaci&oacute;n dentro de las &aacute;reas de trabajo:</i><br>
            <blockquote>
                Los asistentes de voz se pueden integrar con dispositivos de automatizaci&oacute;n dentro de las oficinas, como termostatos inteligentes y sistemas de seguridad, para controlarlos 
                mediante el uso de comandos de voz.<br>
                <br>
            </blockquote>

                <i>Programaci&oacute;n de citas y recordatorios:</i><br>
            <blockquote>
                Mediante la integraci&oacute;n con servicios de calendario un voice assistant puede programar citas y recordatorios para los empleados de la oficina.<br>
                <br>
            </blockquote>

                <i>Control de dispositivos de oficina:</i><br>
            <blockquote>
                Estos asistentes tienen la capacidad de colaborar con dispositivos de oficina, como impresoras y sistemas de proyecci&oacute;n, mediante el uso de IoT, para controlarlos con la voz.<br>
                <br>
            </blockquote>

            <LI><b>Asistencia a empleados</b><BR>
                <BR>

                   <i> Programaci&oacute;n de recordatorios:</i><br>
                <blockquote>
                    Gracias al uso de los asistentes de virtuales, los empleados pueden mantenerse organizados y cumplir con sus compromisos de manera m&aacute;s eficiente. Esto, mediante la integraci&oacute;n de 
                    calendarios espec&iacute;ficos para cada &aacute;rea.<br>
                    <br>
                </blockquote>

                   <i>Resoluci&oacute;n de dudas:</i> <br>
                <blockquote>
                    Los asistentes de voz pueden proporcionar respuestas a preguntas frecuentes de los empleados de manera mucho m&aacute;s oportuna. Esto permite que los empleados obtengan informaci&oacute;n 
                    m&aacute;s eficientemente y ahorren tiempo al no tener que buscar informaci&oacute;n en diferentes lugares.<br>
                    <br>
                </blockquote>

                    <i>Recepci&oacute;n de llamadas:</i><br>
                <blockquote>
                    Con el adecuado entrenamiento, un asistente de voz puede fungir como operador telef&oacute;nico, lo cual libera tiempo de los empleados para que puedan enfocarse en otras tareas m&aacute;s 
                    importantes.<br>
                    <br>
                </blockquote>

            <LI><b>Transporte y log&iacute;stica</b><BR>
                <BR>
                    <i>Programaci&oacute;n de env&iacute;os:</i><BR>
                <blockquote>
                    Los equipos encargados de enviar paqueter&iacute;a se ven altamente beneficiados con el uso de asistentes de voz, ya que estos les permiten automatizar la programaci&oacute;n de los env&iacute;os. 
                    De esta manera, ahorran tiempo en el procesamiento de los pedidos.<BR>
                    <BR>
                </blockquote>

                   <i> Monitoreo de veh&iacute;culos:</i><BR>
                <blockquote>
                    Los asistentes de voz pueden brindar informaci&oacute;n en tiempo real sobre la ubicaci&oacute;n y los recorridos de las flotillas. Esto ayuda a que los empleados tomen decisiones para mejorar el 
                    rendimiento de sus veh&iacute;culos.<BR>
                    <BR>
                </blockquote>

                    <i>Trazado de rutas:</i><BR>
                <blockquote>
                    Los conductores pueden elegir los caminos m&aacute;s r&aacute;pidos y seguros usando un asistente de voz. Esta tecnolog&iacute;a ofrece informaci&oacute;n en tiempo real sobre el tr&aacute;fico 
                    y el estado de las carreteras, por lo que los conductores pueden efectuar su trabajo de manera m&aacute;s eficiente y ahorrar coombustible.<BR>
                    <BR>
                </blockquote>

            <LI><b>Uso personal</b><br>
                <br>
                   <i>Hogares inteligentes:</i><br>
                <blockquote>
                   Programar la hora en que prenden y apagan las luces, controlar la temperatura dentro de la casa, actualizar la lista de la compra, son solo algunos de los usos que pueden darse a los asistentes 
                   de voz dentro de un hogar.<br>
                   <br>
                </blockquote>

                   <i>Realizaci&oacute;n de compras:</i><br>
                <blockquote>
                   Este tipo de tecnolog&iacute;a permite a los usuarios realizar compras &uacute;nicamente usando su voz. Esto puede ser especialmente &uacute;til para las personas que tienen dificultades para 
                   usar dispositivos m&oacute;viles o para aquellas que simplemente quieren ahorrar tiempo.<br>
                    <br>
                </blockquote>

                   <i>B&uacute;squedas por internet:</i><br>
                <blockquote>
                   Uno de los usos m&aacute;s comunes que se le da a este tipo de dispositivos en el hogar es buscar en internet. Desde preguntar c&oacute;mo se prepara un platillo, hasta conocer los horarios 
                   de atenci&oacute;n de un negocio, los asistentes de voz permiten a los usuarios informarse manteniendo sus manos libres.<br>
                   <br>
                </blockquote>

            <LI><b>Medicina</b><BR>
                <BR>
                    <i>Triage:</i><br>
                <blockquote>
                    Identificar los s&iacute;ntomas y malestares de un paciente para clasificar el tipo de atenci&oacute;n que debe recibir es posible mediante el uso de un asistente de voz. Esto es particularmente 
                    &uacute;til en las temporadas que aumenta el flujo de pacientes.<br>
                    <br>
                </blockquote>

                <i>Atenci&oacute;n b&aacute;sica:</i><br>
                <blockquote>
                    Si bien un asistente de voz no puede reemplazar a un m&eacute;dico, si puede ofrecer orientaci&oacute;n b&aacute;sica sobre determinados temas. El nivel de complejidad de los consejos que pueda 
                    ofrecer depender&aacute; de las interacciones y aprendizaje que este reciba.<br>
                    <br>
                </blockquote>

                <i>Tareas administrativas:</i><br>
                <blockquote>
                    El uso de la tecnolog&iacute;a ha hecho m&aacute;s eficiente la labor del personal m&eacute;dico, ya que esta les permite ahorrar tiempo. Usando asistentes de voz una persona puede acceder 
                    a informes m&eacute;dicos o historiales cl&iacute;nicos en cuesti&oacute;n de segundos.<br>
                    <br>
                </blockquote>
            </UL>
            </ul>
        </UL>

        <CEnter><table border cellpadding="10">
                
            <ul><tr>
                   <th bgcolor="#FFFF00">VENTAJAS</th>
                   <th bgcolor="#FFFF00">DESVENTAJAS</th>
                </tr>

                <TR>
                    <TD bgcolor="#CCCCCC"><li> Conecci&oacute;n con otros dispositivos<BR>
                       <BR>
                    <IMG SRC="https://www.redeszone.net/app/uploads-redeszone.net/2021/12/cantidad-equipos-conectar-router.jpg" width="350" height="150">
                    </TD>
                    <TD bgcolor="#CCCCCC"><li>Acceso a conversaciones<BR>
                       <BR>
                    <IMG SRC="https://ichef.bbci.co.uk/news/640/cpsprodpb/F8E9/production/_107212736_p07bmjy0.jpg" width="350" height="150">
                    </TD>
                </TR>

                <TR>
                    <TD bgcolor="#CCCCCC"><li>Facilidad de uso<BR>
                        <BR>
                    <IMG SRC="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRzUuovIW-h6TOhHyoD_qb1kruYu35KRGx2rQ&usqp=CAU" width="350" height="150">
                    </TD>
                    <TD bgcolor="#CCCCCC"><li>Informaci&oacute;n personal<BR>
                        <BR>
                    <IMG SRC="https://www.elciudadano.com/wp-content/uploads/2020/05/d-1024x819-1.jpg" width="350" height="150">
                    </TD>
                </TR>

                <TR>
                    <TD bgcolor="#CCCCCC"><li>Control centralizado<BR>
                        <BR>
                    <IMG SRC="https://cdn.aarp.net/content/dam/aarp/home-and-family/personal-technology/2019/10/1140-smart-speaker-types-esp.imgcache.rev.web.1000.575.jpg" width="350" height="150">
                    </TD>
                    <TD bgcolor="#CCCCCC"><li>Uso de internet<BR>
                        <BR>
                    <IMG SRC="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQVz12uNM-3-e_oK9S5DVOC8HAKFj5xz2y28A&usqp=CAU" width="350" height="150">
                    </TD>
                </TR></ul>
                </table></blockquote></CEnter>
             
                    <center>Los asistentes de voz m&aacute;s utilizados<br>
                        <br>
                    <A HREF="https://home.google.com/intl/es_es/what-is-google-home/#:~:text=La%20aplicaci%C3%B3n%20Google%20Home%20te%20permite%20configurar%2C%20gestionar%2C%20automatizar%20y,poner%20las%20noticias%20y%20m%C3%A1s.">Google Home</A><br>
                    <A HREF="https://es.digitaltrends.com/inteligente/que-es-alexa/">Alexa</A><br>
                    <A HREF="https://www.pocket-lint.com/es-es/aplicaciones/noticias/google/137722-que-es-el-asistente-de-google-como-funciona-y-que-dispositivos-lo-ofrecen/">Google Assistant</A><br>
                    <A HREF="https://www.pocket-lint.com/es-es/aplicaciones/noticias/apple/112346-que-es-el-asistente-de-voz-personal-de-siri-apple/">Siri</A><br>
                    <A HREF="https://www.lenovo.com/mx/es/faqs/pc-vida-faqs/como-usar-windows-cortana/?orgRef=https%253A%252F%252Fwww.google.com%252F">Cortana</A><br>
                    <A HREF="https://www.samsung.com/latin/support/mobile-devices/what-is-bixby-and-how-do-i-use-it/">Bixby</A><br>
              </center>
        </p></blockquote>

         <P><blockquote>
            <UL>
                <LI><h2>Smartphones</h2><BR>
                    <BR>
                        Seg&uacute;n (DIGITAL, 2019) La evoluci&oacute;n tecnol&oacute;gica ha permitido la llegada de nuevas herramientas a aparatos electr&oacute;nicos como los smartphones. Una de las m&aacute;s usadas y 
                        que cada vez toma m&aacute;s fuerza es la Inteligencia Artificial, un concepto que ha dejado de verse como futurista y lejano para cobrar vida en la cotidianidad. Gracias a la llamada IA, los 
                        dispositivos m&oacute;viles ofrecen funciones que ayudan a mejorar la experiencia de uso y el desempe&ntilde;o de los mismos aparatos, mediante la gesti&oacute;n de los recursos 
                        que tiene el tel&eacute;fono, as&iacute; como el procesamiento de la informaci&oacute;n que se almacena en ellos. En la actualidad, la Inteligencia Artificial se aplica en diferentes aspectos de los 
                        smartphones y cobrar&aacute; mayor protagonismo con los a&ntilde;os, tanto que para el a&ntilde;o 2022 
                        el 80 % de los tel&eacute;fonos estar&aacute;n dotados de alg&uacute;n tipo de IA, seg&uacute;n dice la firma de investigaci&oacute;n Gartner. 
                        Cuando las personas hablan sobre la llegada de la inteligencia artificial a los tel&eacute;fonos celulares, se refieren a procesadores con redes de procesamiento 
                        neuronal. En estos casos, la inteligencia artificial est&aacute; incrustada en el coraz&oacute;n del tel&oacute;fono y es lo que permite al m&oacute;vil, entre muchas otras cosas, elegir 
                        c&oacute;mo administrar sus recursos para funcionar de la mejor manera posible.<BR>
                        <BR>
                <ul>
                    <LI><b>Tipos de funciones de la inteligencia artificial en los dispositivos m&oacute;viles</b><BR>
                        <BR>
                    <UL>
                        <LI><i>Identificaci&oacute;n de im&aacute;genes en tiempo real:ss</i><BR>
                            <br>
                        <blockquote>
                        Gracias a la Inteligencia Artificial, los smartphones con procesadores que integran IA son capaces de identificar cierto n&uacute;mero de im&aacute;genes y escenarios en tiempo real. 
                        Para el caso del P smart 2019, el dispositivo puede identificar 22 categor&iacute;as de im&aacute;genes y m&aacute;s de 500 escenarios con su c&aacute;mara posterior.<BR>
                        <BR>
                        </blockquote>

                        <LI><i>Reconocimiento de escenas en la c&aacute;mara frontal con IA:</i><BR>
                            <br>
                        <blockquote>
                        Para ofrecer una experiencia completa, el P smart 2019 tambi&eacute;n es capaz de reconocer 8 escenas selfie, ajustando la configuraci&oacute;n de la c&aacute;mara para entregar el mejor
                        resultado.<BR>
                            <BR>
                        </blockquote>

                        <LI><i>Mejor reproducci&oacute;n de color en las fotograf&iacute;as:</i><BR> 
                        <br>
                        <blockquote>
                        A trav&eacute;s del contraste de las im&aacute;genes, la Inteligencia Artificial es capaz de resaltar ciertos objetos dentro de la fotograf&iacute;a y optimizarlos por separado, 
                        permitiendo que los usuarios obtengan fotograf&iacute;as con calidad profesional.<BR>
                        <BR>
                        </blockquote>

                        <LI><i>Un efecto bokeh m&aacute;s natural:</i><BR> 
                        <br>
                    <blockquote>
                        La Inteligencia Artificial tambi&eacute;n ayuda a reconocer escenas selfie con el fin de ofrecer un efecto bokeh m&aacute;s natural. Para ello, 
                        optimiza las fotos en tiempo real con la tecnolog&iacute;a IA, y as puede capturar retratos perfectos.<BR>
                        <BR>
                        </blockquote>

                        <LI><i>Embellecimiento de Selfie con IA:</i><BR>
                            <br>
                        <blockquote>
                        Los usuarios que tienen dispositivos con IA en la c&aacute;mara, pueden acceder a iluminaci&oacute;n de nivel profesional en sus capturas, gracias al ajuste del nivel 
                        de brillo que realiza el smartphone de forma inteligente. <BR>
                         <BR>
                         </blockquote>
            </UL></ul>
            </UL>

            <CENTER><IMG SRC="https://data360.com.co/wp-content/uploads/2020/02/679de0f7-ia_2.gif" width="800" height="700"></CENTER><BR>
                <BR>

                <P><blockquote>
                        Deacuerdo al autor (RUIZ, 2018) Afirma que Los desarrollos y tendencias tecnol&oacute;gicas de vanguardia se van incorporando a diferentes dispositivos, y a la vida 
                        de sus usuarios, incluso sin que estos sean conscientes de ello. Tomar mejores fotos o utilizar los servicios de un asistente digital se han convertido en acciones cotidianas, 
                        de manera que muchos no reparan en la tecnolog&iacute;a que hay detr&aacute;s de ellas. La Inteligencia Artificial (IA) se ha convertido en una de estas tendencias de las que se habla mucho, 
                        porque est&aacute; presente en una gran cantidad de equipos de uso diario; entre ellos, los celulares inteligentes.<BR>
                        <BR>

                        Hasta hace alg&uacute;n tiempo, la IA estaba reservada para los equipos m&aacute;s costosos, los de gama alta, que utilizaban la tecnolog&iacute;a m&aacute;s avanzada. Pero los 
                        fabricantes de procesadores y de componentes se han preocupado por llevar a la gama medias funciones avanzadas por
                        precios m&aacute;s asequibles. La inteligencia artificial (IA) est&aacute; tomando cada vez m&aacute;s peso en todo lo que nos rodea. Gran parte de la importancia que va ganando 
                        esta tecnolog&iacute;a viene provocada por el auge del uso de los asistentes virtuales. Las personas cada vez van 
                        “confiando” m&aacute;s en estos dispositivos y los utilizan en su d&iacute;a a d&iacute;a.<BR>
                        <BR>

                        En los tel&eacute;fonos m&oacute;viles m&aacute;s recientes de los principales fabricantes como Samsung, Google o Apple se puede observar el uso que se hace de sistemas basados en 
                        IA de estos dispositivos. Gracias a los avances de los componentes de cualquier smartphone o tablet como 
                        c&aacute;maras, sensores y micr&oacute;fonos m&aacute;s avanzados hacen que tengamos a mano en nuestro d&iacute;a a d&iacute;a estos dispositivos. Los sistemas que se implementan en 
                        cualquier dispositivo m&oacute;vil que permite que a trav&easter;s de la c&aacute;mara trasera puedan ver y reconocer objetos, clasificarlos 
                        y hasta hacer b&uacute;squedas en internet relacionadas a estos productos.<BR>
                        <BR>

            <center><A href="https://revistas.unesum.edu.ec/index.php/unesumciencias/article/view/460/592"><b>M&aacute;s infotmaci&oacute;n aqui</b>.</A></center>

         </blockquote></P>

         <p><blockquote>
            <UL>
                <LI><h2>Robotica</h2><BR>

                    <IMG SRC="https://i.gifer.com/origin/ed/ed2c8e819e41a601637f492c80317ad0_w200.gif" width="300" height="400" ALIGN="RIGHT">

                    La IA es una de las tecnolog&iacute;as que m&aacute;s impulso ha supuesto para la rob&oacute;tica m&oacute;vil y la automatizaci&oacute;n. Se trata de que un <A href="https://robotnik.eu/es/que-es-un-robot-movil-autonomo-amr-lo-que-aportan-nuestros-robot-moviles-a-tu-empresa/">AMR</A> 
                    sea capaz de tomar decisiones eficaces y flexibles en tiempo real.
                    La inteligencia artificial aplicada a la rob&oacute;tica ofrece una forma nueva en que los robots (software) ejecutan las &oacute;rdenes o tareas que se le encargan.<br>
                    <BR>

                    No es lo mismo un software de IA que un programa o aplicaci&oacute;n inform&aacute;tica. Con un programa, el robot no piensa por s&iacute; mismo, sino que cumple ciertas &oacute;rdenes combinando un conjunto 
                    de instrucciones que se han definido previamente.<br>
                    <br>
                <UL>
                    <LI><H3>&#191;C&oacute;mo funciona un robot con IA?</H3><BR>
                    Cuando un robot integra algoritmos de IA, no necesita recibir &oacute;rdenes para tomar una decisi&oacute;n, sino que es capaz de trabajar por s&iacute; mismo tras haber superado una fase de ‘entrenamiento’ 
                    o ensayo-error. Gracias al Machine Learning o aprendizaje autom&aacute;tico, el robot es capaz de aprender, resolver, comprender, razonar o reaccionar de forma ó&oacute;ptica.<BR>
                     <BR>

                    La mayor&iacute;a de los robots no son inteligentes, pero en 2022 las empresas ya no solo buscan automatizar ciertos procesos, sino que apuestan por la automatizaci&oacute;n inteligente. 
                    En muchos casos ya no basta con un robot capaz de transportar peso: hay una clara tendencia hacia robots m&oacute;viles y aut&oacute;nomos capaces de recopilar, procesar y gestionar los datos de forma inteligente, y 
                    tomar las mejores decisiones en cuanto a la fabricaci&oacute;n o producci&oacute;n.<BR>
                     <BR>

                    Esto explica el aumento de <A href="https://robotnik.eu/es/que-es-un-robot-movil-autonomo-amr-lo-que-aportan-nuestros-robot-moviles-a-tu-empresa/">AMR</A> trabajando en nuevos entornos como 
                    la construcci&oacute;n o la medicina, y realizando nuevas tareas como inspecci&oacute;n, mantenimiento o rescate.<BR>
                    <BR>

                    <li><h3>Ejemplo de aplicaci&oacute;n de rob&oacute;tica m&oacute;vil e IA</h3><br>
                        Las ventajas de la uni&oacute;n entre inteligencia artificial y robots para aplicaciones industriales ya las est&aacute;n viendo numerosas f&aacute;bricas.<BR>
                    <BR>

                    Un almac&eacute;n es un espacio din&aacute;mico, cambiante. Los robots y manipuladores m&oacute;viles de Robotnik, al integrar algoritmos de IA, son capaces de navegar de forma aut&oacute;noma 
                    y tomar decisiones en tiempo real adapt&aacute;ndose a los imprevistos.<BR>
                     <BR>   

                    El <A href="https://robotnik.eu/es/que-es-un-robot-movil-autonomo-amr-lo-que-aportan-nuestros-robot-moviles-a-tu-empresa/">AMR</A> cuenta con un aprendizaje automatizado, ‘entrenado’ 
                    previamente para adquirir conocimientos y patrones que le permitan predecir y recalcular funciones, tareas o rutas.<BR>
                    <BR>
                    </UL>
         </UL>
         </blockquote></p>
     
        <p><blockquote>
            <ul>
                <LI><h2>Monitoreo en redes sociales</h2><br>
                    <br>
                    Es una disciplina que recoge todas las menciones y conversaciones p&uacute;blicas de Internet, las almacena en grandes sistemas de datos (<A href="https://www.iberdrola.com/innovacion/que-es-para-que-sirve-big-data"> big data </A>) 
                    y luego procesa esa informaci&oacute;n para entender de qu&eacute; se habla, con qu&eacute; volumen y quienes son los que hablan sobre cada tema, 
                    para entonces establecer relaciones de datos que permitan segmentarlos, mapearlos y entender sus gustos, intereses y preocupaciones.<br>
                    <br>

                    Las tecnolog&iacute;as disponibles en el mercado permiten inclusive hacer an&aacute;lisis para determinar el sentimiento de las menciones, estableciendo si son positivas, negativas o neutrales, 
                    permiten tambi&eacute;n detectar a los influenciadores, separarlos y darles seguimiento puntual, analizar el uso de hashtags, los d&iacute;as de la semana y hasta los horarios de menciones m&aacute;s 
                    intensas sobre un tema.<br>
                    <br>

                    Gracias al monitoreo de redes sociales y de las menciones en Internet se pueden identificar los t&eacute;rminos, frases y palabras m&aacute;s usados en las conversaciones tanto positivas como 
                    negativas y as&iacute; saber inclusive que lenguaje usa la gente a la que se quiere llegar.<br>
                    <br>
                    <ul>
                    <LI><h3>&#191;Por qu&eacute; es importante el monitoreo de redes sociales?</h3><br>
                        <br>
                        El monitoreo de redes sociales es importante porque ayuda a la empresa a obtener informaci&oacute;n importante sobre la percepci&oacute;n que tiene la audiencia de determinada 
                        red social sobre la marca. La informaci&oacute;n que se recopila con esta pr&aacute;ctica resulta de mucha utilidad ya que se puede utilizar para:<br>
                        <br>
                    <Ul>
                        <li>Implementar acciones de contenci&oacute;n en crisis de imagen de marca.
                        <li>Mejoras o modificaciones en productos o en el servicio de la empresa.
                        <li>Generaci&oacute;n de una mejor imagen de marca.
                        <li>Creaci&oacute;n de mejores pr&aacute;cticas por parte del personal de la empresa.
                    </Ul>
                    <br>
                </ul>
                    </ul><br>
                       La inteligencia artificial desempe&ntilde;a un papel fundamental en el monitoreo de las redes sociales. Aqu&iacute; tienes algunas formas en las que se utiliza:<br>
                   <OL>
                <br>
                   <li><b>An&aacute;lisis de sentimiento:</b> <br>
        <blockquote>    
                La IA puede analizar el sentimiento de los mensajes en las redes sociales, ayudando a las empresas y organizaciones a comprender c&oacute;mo se sienten los usuarios 
                hacia sus productos, servicios o temas espec&iacute;ficos.<br>
            <br>
        </blockquote>  

            <li><b> Detecci&oacute;n de tendencias: </b><br>
        <blockquote>    
                La IA puede identificar tendencias emergentes en las redes sociales al analizar grandes cantidades de datos en tiempo real, lo que permite a las empresas adaptar sus estrategias 
                de marketing y toma de decisiones.<br>
            <br>
        </blockquote>

            <li><b> Automatizaci&oacute;n de respuestas: </b><br>
        <blockquote>    
                Los chatbots y asistentes virtuales basados en IA pueden responder autom&aacute;ticamente a preguntas frecuentes o brindar asistencia b&aacute;sica a los usuarios en las 
                redes sociales, mejorando la atenci&oacute;n al cliente.<br>
            <br>
        </blockquote>

            <li><b> Identificaci&oacute;n de amenazas y abuso: </b><br>
        <blockquote>    
                La IA puede ayudar a identificar contenido inapropiado, discursos de odio o amenazas en las redes sociales, lo que es crucial para mantener un entorno seguro en l&iacute;nea.<br>
            <br>
        </blockquote>

            <li><b>Segmentaci&oacute;n de audiencia:</b><br>
        <blockquote>   
            La IA puede ayudar a las empresas a segmentar a su audiencia en funci&oacute;n de sus intereses y comportamientos, lo que facilita la personalizaci&oacute;n de contenidos y estrategias.<br>
            <br>
        </blockquote>
        </OL>
        </blockquote></p>

        <blockquote><P>
         <UL>
            <li><h2>La IA en GPS y sistemas de geolocalizaci&oacute;n</h2><BR>
                <BR>
            La Inteligencia Artificial y el GPS mejoran la seguridad y la sensaci&oacute;n de control que los pasajeros y el conductor tienen de la experiencia de trasladarse en veh&iacute;culos. 
            Recopilando datos y aplicando algoritmos, la IA va a responder cuando el conductor no est&eacute; atento. Detectar a otros veh&iacute;culos, controlar la velocidad, el ruido, las 
            l&iacute;neas de los carriles y se&ntilde;ales son algunos de los aspectos a incorporar.<br>
            <br>
        <ul>
            <li><h3>Beneficios</h3><br>
                <b>Mejora de la Precisi&oacute;n:</b><br> 
            <blockquote>    
                La IA ha permitido el desarrollo de algoritmos de correcci&oacute;n de se&ntilde;al que mejoran la precisi&oacute;n del GPS. Esto es especialmente crucial en entornos urbanos 
                densos o en lugares con obst&aacute;culos naturales, como ca&ntilde;ones o bosques.<br>
                <br>
            </blockquote>

                <b>Navegaci&oacute;n Aut&oacute;noma:</b> 
            <blockquote>    
                La IA se utiliza en veh&iacute;culos aut&oacute;nomos para la navegaci&oacute;n. Los sistemas de GPS basados en IA permiten que los veh&iacute;culos tomen decisiones en tiempo real 
                sobre la mejor ruta a seguir, considerando el tr&aacute;fico, las condiciones meteorol&oacute;gicas y otros factores.<br>
                <br>
            </blockquote>

                <b>Optimizaci&oacute;n de Rutas:</b><br>
            <blockquote>    
                Los algoritmos de IA pueden analizar datos en tiempo real para determinar la ruta m&aacute;s eficiente y r&aacute;pida hacia un destino, teniendo en cuenta variables como el tr&aacute;fico 
                y los cierres de carreteras.<br>
                <br>
            </blockquote>

                <b>Seguridad en la Navegaci&oacute;n:</b><br>
            <blockquote>   
                La IA se utiliza para identificar peligros en la carretera, como accidentes o condiciones clim&aacute;ticas adversas, y proporcionar advertencias a los conductores.<br>
                <br>
            </blockquote>

                <img src="https://www.controlgps.es/wp-content/uploads/2019/12/Control-de-Recorrido.gif" width="700" height="400" ><br>
                <br>

            </ul>
                Si bien la mejora de la seguridad vial es crucial, no es la &uacute;nica perspectiva de la uni&oacute;n de la Inteligencia Artificial con el GPS.<br>
                <br>

                En 2020, el Instituto de Tecnolog&iacute;a de Massachusetts (MIT) de Estados Unidos y el QCRI (Instituto de Investigaci&oacute;n Inform&aacute;tica de Qatar), 
                desarrollaron Road Tagger. Este sistema utiliza inteligencia artificial e im&aacute;genes satelitales para ofrecer mapas digitales m&aacute;s actualizados.<br>
                <br>

                De hecho, es muy importante para la seguridad vial ya que permite predecir de manera autom&aacute;tica el tipo de carretera y n&uacute;mero de carriles, incluso 
                sugerir cambios de carril.<br>
                <br>

                Otro desaf&iacute;o de la uni&oacute;n de la Inteligencia Artificial con el GPS est&aacute; en la navegaci&oacute;n a&eacute;rea y mar&iacute;tima, a la que 
                podr&iacute;a ofrecer precisiones milim&eacute;tricas.<br>
                <br>

                Sin embargo, seg&uacute;n los especialistas, la mejor expresi&oacute;n de la combinaci&oacute;n de la Inteligencia Artificial con el GPS se encuentra en los 
                veh&iacute;culos aut&oacute;nomos. &Eacute;stos ya comienzan a formar parte del paisaje cotidiano: en Europa varias l&iacute;neas de subterr&aacute;neo cuentan con veh&iacute;culos aut&oacute;nomos. 
                Los aeropuertos los utilizan para trasladar pasajeros entre terminales. En China ya circulan taxis aut&oacute;nomos en las calles de las principales ciudades.<br>
                <br>
            </ul>

            <ul>
                <li><h2><b>Inteligencia Artificial en los veh&iacute;culos aut&oacute;nomos</b></h2><br>
                <br>
                Un veh&iacute;culo aut&oacute;nomo es aquel que re&uacute;ne los sensores, procesadores, actuadores y software necesarios para conducirse de forma aut&oacute;noma, 
                aunque a priori nos siga pareciendo algo extra&ntilde;o, poco a poco estos ir&aacute;n formando parte de nuestras comunes vidas.<br>
                <br>

                El avance tecnol&oacute;gico y las diferentes normativas europeas ir&aacute;n a la par. Por tanto, la implantaci&oacute;n de los coches aut&oacute;nomos ser&aacute; paulatina. 
                Pero lo que s&iacute; podemos asegurar es que es imparable y es el camino que toda la sociedad est&aacute; siguiendo. A partir del 2025 podremos ver veh&iacute;culos 
                completamente aut&oacute;nomos por nuestras carreteras.<br>
                <br>

                Los veh&iacute;culos con autonom&iacute;a ya est&aacute;n implantados, pero con la intervenci&oacute;n humana ya que, la conducci&oacute;n aut&oacute;noma cuenta con 5 niveles
                 de conducci&oacute;n aut&oacute;noma que se dividen en: solo conductor, asistida, automatizaci&oacute;n parcial, automatizaci&oacute;n 
                elevada y automatizaci&oacute;n completa; existiendo a su vez, tres actores primarios: el conductor como factor humano, el sistema de conducci&oacute;n aut&oacute;noma y el coche en 
                s&iacute; mismo con los sistemas convencionales oportunos.<br>          
                <br>
            </ul>

                <img src="https://business.trustedshops.es/hs-fs/hubfs/1-TS_B2B/content/PL/20230209-sztuczna-inteligencja-w-ecommerce/blogtitle-ai-w680h280.png?width=645&height=266&name=blogtitle-ai-w680h280.png" width="500" height="300" align="right"><br>
                <br>
                <img src="https://57i2c0.p3cdn2.secureserver.net/wp-content/uploads/2021/06/ecommerce-inteligencia-artificial-scaled.jpg?time=1697672295" width="500" height="300" align="left"><br>
                <br>
            </p></blockquote>
            <br>

            <p><blockquote>
            <center><table border cellpadding="10">
                
                <tr>
                    <th bgcolor="#FFFF00">Niveles de la conducci&oacute;n autonoma</th>
                    <th bgcolor="#FFFF00">Funci&oacute;n</th>
                </tr>
                <tr>
                    <td bgcolor="#CCCCCC"><b>Nivel 1: Asistencia en la conducci&oacute;n</b></td>
                <ul>
                    <td bgcolor="#CCCCCC"><li>El veh&iacute;culo cuenta con alg&uacute;n sistema de ayuda a la conducci&oacute;n, como por ejemplo: Mantenimiento del carril, controles de 
                        velocidad adaptativos o no.<br>
                    <br>
                    <li>Este nivel est&aacute; pensado para que el conductor pueda tener una conducci&oacute;n m&aacute;s c&oacute;moda, es una ayuda que mejora la seguridad al volante.</td><br>
                        <br>
                </ul>
                </tr>

                <tr>
                    <td bgcolor="#CCCCCC"><b>Nivel 2: Automatizaci&oacute;n parcial</b></td>
                <ul>    
                    <td bgcolor="#CCCCCC"><li>Se precisa conductor, aunque este no realizar&aacute; tareas relativas al movimiento.<br>
                    <br>
                    <li>El veh&iacute;culo cuenta con control de movimiento tanto longitudinal como lateral, aunque no tiene detecci&oacute;n y respuesta ante objetos.<br>
                    <br>
                    <li>El veh&iacute;culo tendr&aacute; capacidad de actuar de forma independiente ya que pueden realizar una o varias tareas hasta ahora 
                    realizadas por el conductor.</td><br>
                    <br>
                </ul>
                </tr>

                <tr>
                    <td bgcolor="#CCCCCC"><b>Nivel 3: Automatizaci&oacute;n condicionada</b></td>
                <ul>
                    <td bgcolor="#CCCCCC"><li>Se precisa conductor y aunque la autonom&iacute;a sea m&aacute;s elevada, este deber&aacute; estar atento para intervenir.<br>
                    <br>
                    <li>Tiene sistemas de automatizaci&oacute;n en lo referente al control de movimiento longitudinal y lateral; detecci&oacute;n y respuesta ante objetos.<br>
                    <br> 
                    <li>El veh&iacute;culo podr&aacute; decidir cu&aacute;ndo cambiar de carril, frenar para evitar colisionar con otro veh&iacute;culo, etc., pero, el factor humano 
                        seguir&aacute; siendo clave ya que el sistema puede precisar de su intervenci&oacute;n.</td><br>
                    <br>
                </ul>
                </tr>

                <tr>
                    <td bgcolor="#CCCCCC"><b>Nivel 4: Automatizaci&oacute;n elevada</b></td>
                <ul>
                    <td bgcolor="#CCCCCC"><li>No se precisar&aacute; de la intervenci&oacute;n humana en ning&uacute;n momento ya que el coche ser&aacute; el propio veh&iacute;culo qui&eacute;n 
                        controlar&aacute; el tr&aacute;fico y las condiciones del entorno, definir&aacute; la ruta o alternativas y responder&aacute;n ante cualquier situaci&oacute;n.<br>
                    <br>
                    <li>En el caso de existir alg&uacute;n fallo del sistema principal, el veh&iacute;culo cuenta con respaldo para actuar y seguir conduciendo.</td><br>
                    <br>
                </ul>
                </tr>

                <tr>
                    <td bgcolor="#CCCCCC"><b>Nivel 5: Automatizaci&oacute;n completa</b></td>
                <ul>
                    <td bgcolor="#CCCCCC"><li>El veh&iacute;culo tendr&aacute; la capacidad, bajo demanda realizada a trav&eacute;s del interfaz por el que se introducir&aacute; 
                        nuestras &oacute;rdenes, de ir a cualquier lugar sin necesidad de volante, pedales, mandos, ya que, el veh&iacute;culo cuenta con sistemas de automatizaci&oacute;n a todos los niveles.<br>
                    <br>
                    <li>A este nivel la figura del conductor, no existe, subiremos al coche, le indicaremos nuestro destino y este se pondr&aacute; en marcha.<br>
                    <br>
                    <li>Cuentan con un sistema de automatizaci&oacute;n que en caso de fallo se respaldar&aacute; con otro sistema, por lo que, &eacute;l mismo solucionar&aacute;a cualquier imprevisto.</td><br>
                    <br>
                </ul>
                </tr>
             </table></center>
             </UL>
             <br>
                    Los veh&iacute;culos con GPS son realmente el futuro de la conducci&oacute;n aut&oacute;noma. &#191;Sabes por qu&eacute;? Porque marcar&aacute;n la ruta en tiempo real 
                    y de forma segura. Esto nos garantiza que el veh&iacute;culo va a seguir la ruta que le hemos asignado por las v&iacute;as y carriles adecuados. Pero, como sabes, para 
                    que esto sea posible los GPS deben ser potentes, pues hay zonas de rutas sin cobertura.<br>
                    <br>

                    Cada avance en los diferentes niveles de conducci&oacute;n han sido el resultado de muchos a&tilde;os de trabajo y dedicaci&oacute;n por parte de las empresas desarrolladoras 
                    de tecnolog&iacute;a de ayuda a la conducci&oacute;n. El nivel 4 y 5 llegar&aacute;n a nuestras carreteras y vidas, aunque para ello tengamos que esperar un poco.<br>
                    <br>

                    <MAP NAME="IA COCHES">
                        <AREA SHAPE="RECT" COORDS="8,9,266,109" HREF="https://revistacentrozaragoza.com/el-presente-y-futuro-de-la-inteligencia-artificial-ia-en-los-coches/">
                        <AREA SHAPE="poly" COORDS="8,117,11,205,486,153" HREF="https://www.webfleet.com/es_es/webfleet/blog/7-aplicaciones-reales-de-la-inteligencia-artificial-en-los-vehiculos/">
                        <AREA SHAPE="circle" COORDS="399,70,83" HREF="https://computerhoy.com/motor/inteligencia-artificial-mundo-sector-automovil-1266250">
                        <AREA SHAPE="DEFAULT" NOHREF>
                        </MAP>
                        <CENTER><IMG SRC="https://media.tenor.com/KafgE4t0ecMAAAAC/optimus-prime-transform.gif" height="" width="" USEMAP="#IA COCHES"></CENTER>

            </P></blockquote>

            <p><blockquote>
            <ul>
                <li><h2>La inteligencia artificial en el ecommerce</h2><br> 
            
                Parec&iacute;a ciencia ficci&oacute;n pero ya es una realidad en muchos sectores. El de la inteligencia artificial es un mercado imparable y ser&aacute; dif&iacute;cil 
                concebir el futuro sin su desarrollo. De hecho, ya es imposible entender el mundo actual sin tecnolog&iacute;as inteligentes. Nos hacen la vida m&aacute;s f&aacute;cil sin 
                que nos demos cuenta. Tambi&eacute;n en la venta online. La inteligencia artificial en eCommerce ha 
                llegado para quedarse y satisfacer el af&aacute;n de muchas empresas por aventajar a sus competidores.<br>
                <br>

                En la era de la omnicanalidad, el eCommerce se han convertido en uno de los canales de venta preferidos y la compra online en una alternativa s&oacute;lida que promete dejar 
                atr&aacute;s los sistemas tradicionales. El comercio digital crece. Las empresas online buscan nuevas f&oacute;rmulas para seguir batiendo sus propias marcas, mejorar el alcance
                 y el rendimiento de su negocio.<br>
                <br>

                Nuevas estrategias, modelos y tecnolog&iacute;as capaces de optimizar las compras por Internet y de enriquecer la experiencia de los clientes. Ah&iacute; est&aacute;n 
                los grandes desaf&iacute;os: en campos tan diversos como la log&iacute;stica y en la capacidad de los eCommerce para conocer a los usuarios, relacionarse con ellos y complacer sus demandas.<br>
                <br>

                Si algo genera el comercio electr&oacute;nico es una gran cantidad de datos. Cuanto m&aacute;s sepamos de lo que dicen y hacen los consumidores en cada momento m&aacute;s 
                &uacute;til ser&aacute; para nuestro negocio. Cuanto mejor se administre esa informaci&oacute;n y mejor se aproveche, mayor valor tendr&aacute;.<br>
                <br>

                En este sentido, el big data es un gran aliado de los vendedores online, que ahora cuentan, adem&aacute;s, con la complicidad de la inteligencia artificial para agilizar 
                la gesti&oacute;n de esa cantidad inmensa de datos y ganar un nuevo espacio dentro del mercado eCommerce.<br>
                <br>
              <ul>
                <li><H3>Soluciones que ofrece la inteligencia artificial en eCommerce<br></H3>
                    <br>
                Hay tres grandes &aacute;reas que concentran algunos de los retos fundamentales para las empresas de comercio electr&oacute;nico, que afectan directamente a las necesidades 
                de los consumidores, al proceso de compra y al modelo de entrega m&aacute;s o menos eficiente de los pedidos online.<BR>
                    <BR>

                <B>1.Experiencia de usuario personalizada</B><BR>
                    <BR> 
        <blockquote>
                La inteligencia artificial en eCommerce ayuda a los vendedores a ofrecer experiencias personalizadas de compraventa gracias al an&aacute;lisis de los patrones de consumo de los clientes. 
                La clave est&aacute; en la calidad de los datos disponibles y en la capacidad de cada empresa para examinar los datos de forma eficaz.<BR>
                <BR>     

                Se trata de conocer m&aacute;s y mejor a los consumidores, de segmentar el p&uacute;blico objetivo, de establecer perfiles que permitan dise&ntilde;ar campa&ntilde;as y mensajes 
                exclusivos para cada cliente en funci&oacute;n de sus h&aacute;bitos y preferencias: historial de b&uacute;squedas, interacciones virtuales, compras, similitudes con otros clientes…<BR>
                <BR> 

                El deep learning (aprendizaje profundo) es una subcategor&iacute;a del machine learning, una tecnolog&iacute;a que busca imitar al cerebro humano, procesar conjuntos de datos a 
                gran escala y crear patrones para la toma de decisiones. Reconoce normas de comportamiento, actitudes, gustos, intenciones preferencias y permite ofrecer recomendaciones personalizadas y m&aacute;s precisas.<BR>
                <BR>   

                Los eCommerce delegan en los algoritmos, que aprenden con la pr&aacute;ctica e intuyen a partir de la experiencia cual ser&aacute; desenlace del proceso de compra. 
                Las empresas reaccionan antes y de forma autom&aacute;tica. Optimizan el viaje online del cliente, lo hacen m&aacute;s atractivo, m&aacute;s c&oacute;modo, ajustado a sus necesidades reales.<BR>
                <BR>      

                <I>Recomendaciones personalizadas: el caso de Retail RocketS</I><BR>
                <BR>     

                Uno de los ejemplos de la aplicaci&oacute;n de este tipo de tecnolog&iacute;as al eCommerce es el de Retail Rocket, que cuenta con una herramienta que accede a la 
                tecnolog&iacute;a de big data y an&aacute;lisis predictivo de m&aacute;s alto nivel, y lo implementa en las tiendas online en tiempo real. Adem&aacute;s, ofrece 
                soluciones de eCommerce para personalizar la web y el canal de email marketing.<BR>
                <BR>   

                Retail Rocket proporciona m&aacute;s de 20 mecanismos de autoaprendizaje para personalizar la experiencia de compra del usuario. Dando uso a una tecnolog&iacute;a avanzada, 
                logra detectar las necesidades e intereses de los usuarios en la tienda online al analizar su comportamiento en tiempo real. Gracias a este tipo de soluciones Decathlon logr&oacute; 
                aumentar la conversi&oacute;n en un 5,2%, el valor de los pedidos promedio 
                en un 5,2% y los ingresos en un 10,7% despu&eacute;s de a&ntilde;adir recomendaciones de productos personalizadas en su web holandesa.<BR>
                <BR>
        </blockquote>
                <IMG SRC="https://difusionconcausa.com/wp-content/uploads/2022/07/experiencia-de-usuario.gif" width="700" height="400">

                <IMG SRC="https://www.vedia.ai/blog/wp-content/uploads/2019/06/Video-Personalization.gif" width="700" height="400" ALIGN="RIGHT"><BR>
                    <BR>

                <B>2. Atenci&oacute;n al cliente</B><BR>
                <BR>
                    <IMG SRC="https://digitalworkers.cl/imagenes/chatbot.gif" width="500" height="400" ALIGN="RIGHT"><BR>
                        <BR>
                    De nuevo entran en juego tecnolog&iacute;as que imitan el funcionamiento del cerebro humano, sistemas inform&aacute;ticos automatizados capaces de resolver problemas sin 
                    necesidad de que intervenga una persona. En este caso, la inteligencia artificial en eCommerce ofrece sistemas de procesamiento del lenguaje natural que ya se aplican en 
                    &aacute;reas de atenci&oacute;n al cliente y asistencia en ventas, por ejemplo, a trav&eacute;s de las redes sociales.<BR>
                    <BR>

                    Los chatbots son capaces de simular, cada vez m&aacute;s, conversaciones fluidas, precisas y naturales a trav&eacute;s de Internet con usuarios de carne y hueso. Aprenden de forma 
                    autom&aacute;tica de sus interacciones con los clientes y perfeccionan sus habilidades.<BR>
                    <BR>

                    Representan una alternativa econ&oacute;mica y eficiente, que permite implementar asistentes virtuales para la gesti&oacute;n de pedidos, resoluci&oacute;n de dudas, orientaci&oacute;n 
                    durante el proceso de compra, cobro de productos, elaboraci&oacute;n de informes de mercado.<BR>
                    <BR>

                    <I>El caso de Ingenico</I><BR>
                    <BR>

                    Uno de los ejemplos de esta aplicaci&oacute;n de los chatbots al eCommerce es el de Ingenico ePayments, que anunci&oacute; en septiembre de 2017 el lanzamiento 
                    (en asociaci&oacute;n con la startup californiana Joinedapp) de chatbots habilitados para pagos online. La iniciativa permitir&aacute; a comerciantes y clientes introducirse 
                    en el llamado comercio social o conversacional, que se perfila como el futuro del eCommerce (Conversational Commerce). <BR> 
                    Estos chatbots estar&iacute;an ligados a las principales aplicaciones de mensajer&iacute;a existentes, como Facebook Messenger, Line, Telegram, Kik, Skype y WeChat.<BR>
                    <BR>

                    Al integrar los bots directamente en el proceso de pago, los comerciantes ofrecen a los usuarios experiencias de compra sin interrupciones. As&iacute;, esta nueva soluci&oacute;n 
                    elimina la necesidad de salir de la aplicaci&oacute;n de mensajer&iacute;a para completar una compra, y consigue as&iacute; aumentar la conversi&oacute;n y los ingresos. 
                    Por ejemplo, si tenemos una cuenta en Facebook Messenger, la soluci&oacute;n de comercio conversacional de Ingenico nos permitir&aacute; completar una compra de forma sencilla, r&aacute;pida, y sin salir de la aplicaci&oacute;n.<BR>
                    <BR> 

                <b>3. Log&iacute;stica</b><BR>
                    <BR>
            <blockquote>
                    La calidad y la rapidez en la entrega de un pedido online son claves para el comercio electr&oacute;nico. La inteligencia artificial en eCommerce proporciona algoritmos y aplicaciones
                     cada d&iacute;a m&aacute;s potentes para detectar patrones de consumo, realizar un an&aacute;lisis predectivo y dise&ntilde;ar estrategias de venta y de reposici&oacute;n de mercanc&iacute;a 
                     adaptada no solo a la demanda de los consumidores sino tambi&eacute;n a los intereses de la empresa.<BR>
                    <BR>

                    En este campo las compa&ntilde;&iacute;as invierten en tecnolog&iacute;a de machine learning y automatizaci&oacute;n de procesos rob&oacute;ticos. Por un lado adquieren plataformas 
                    con capacidad de aprendizaje para clasificar datos y anticipar las decisiones de los clientes, y por otro, automatizan tareas humanas para aprovechar al m&aacute;ximo el talento de 
                    los empleados en &aacute;reas m&aacute;s estrat&aacute;gicas y creativas.<BR>
                    <BR>   

                    Ceden a las m&aacute;quinas el control de mercanc&iacute;as y la gesti&oacute;n de los procesos de entrega de las compras online. En la pr&aacute;ctica ahorran tiempo, costes y 
                    agilizan el proceso productivo. Son buenos ejemplos de ello dos experiencias de los gigantes Amazon y Alibaba:<BR>
                    <BR>
                    <br>
            </blockquote>
                    <I><b>Amazon:</b></I><BR>
                    <BR>
                <IMG SRC="https://feedvisor.com/wp-content/uploads/2021/09/integrated-solutions-infographic-v2.gif" width="400" height="200" ALIGN="LEFT"><BR>
                    <BR>
                    <br>
                    <br>
                    <br>
                    Un sistema patentado por la compa&ntilde;&iacute;a de Jeff Bezos (“Method and System for Anticipatory Package Shipping”) para anticipar las compras online que realizan 
                    sus clientes. Se basa en el an&aacute;lisis de big data y en la creaci&oacute;n de un modelo predictivo del comportamiento del consumidor a partir de su historial de 
                    compras y de sus h&aacute;bitos de consumo. Empezar&aacute; a utilizar este m&eacute;todo con productos de uso masivo.<BR>
                    <BR>

                    Podr&aacute; anticipar su demanda en una determinada &aacute;rea geogr&aacute;fica y realizar env&iacute;os de cada producto a los almacenes m&aacute;s cercanos incluso 
                    antes de que el cliente realice la compra. El tiempo de entrega se reducir&aacute; a unas horas.<BR>
                    <BR>

                    <I><b>Alibaba:</b></I><BR>
                    <BR>
                <IMG SRC="https://www.mypress.mx/img/articulos/2784.jpg" width="300" height="150" ALIGN="RIGHT"><BR>
                    <BR>

                    La compa&ntilde;&iacute;a china ha logrado mapear las rutas de entrega m&aacute;s eficientes a partir de los datos geogr&aacute;ficos de sus clientes, 
                    lo que reduce un 30% la distancia recorrida y un 10% el uso de veh&iacute;culos. Aplica este m&eacute;todo en los supermercados Hema, que tambi&eacute;n 
                    presumen de restaurante rob&oacute;tico.<BR>
                    <BR>

                    Adem&aacute;s, Cainiao Network, la empresa log&iacute;stica de Alibaba, anunci&oacute; el a&ntilde;o pasado que durante la pr&oacute;xima d&eacute;cada 
                    reforzar&aacute; su tecnolog&iacute;a de inteligencia artificial con un mill&oacute;n de camionetas inteligentes que le ayudar&aacute;n a hacer frente a 
                    la creciente demanda de entrega de paquetes.<BR>
                    <BR>

                    <I><b>Zara:</b></I><BR>
                    <BR>
                <IMG SRC="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSQuUdowpG3PyPw8gEYdl04IdivN0AgNUyHPH4kJIl9kkVHNr-4-VlJE3w0j0E1VgnB16Q&usqp=CAU" width="500" height="200" ALIGN="LEFT"><BR>
                    <BR>
                    <br>
                    <br>
                    <br>
                    <br>
                    <br>
                    Esta empresa espa&ntilde;ola utiliza la IA para mejorar la eficiencia en su cadena de suministro, optimizando la producci&oacute;n y la distribuci&oacute;n de 
                    productos en funci&oacute;n de la demanda del mercado.<BR>
                    <br>

                    Ademas de la automatizaci&oacute;n y el big data a su estrategia de negocio y a su cadena de suministro con la finalidad de estar por delante de sus competidores minoristas.<br>
                    <BR>

                    <I><b>Walmart:</b></I><BR>
                    <BR>
                <IMG SRC="https://colombiaretail.com/wp-content/uploads/2021/07/Como-Walmart-utiliza-la-inteligencia-artificial-para-realizar-sustituciones-mas-inteligentes-en-los-pedidos-de-comestibles-en-linea.gif" width="400" height="200" ALIGN="RIGHT"><BR>
                    <BR>
                    <br>
                    <br>
                    Esta corporaci&oacute;n americana utiliza la IA para analizar grandes cantidades de datos de ventas y comportamiento del usuario, lo que le facilita tomar decisiones informadas 
                    sobre el marketing y la gesti&oacute;n de sus productos.<BR>
                    <BR>

                    <I><b>Adidas:</b></I><BR>
                    <BR>
                <IMG SRC="https://images.squarespace-cdn.com/content/v1/5c49f5fd3c3a5376885f2399/1644961209706-88GJ907R359WKTYS7GD6/ezgif.com-gif-maker-3.gif" width="400" height="250" ALIGN="LEFT"><BR>
                    <BR>  
                    La marca alemana utiliza la inteligencia artificial para personalizar su oferta de productos, bas&aacute;ndose en las preferencias y el historial de compras de sus clientes.<BR>
                    <BR>
                </ul>
            </ul>
        
        </blockquote></p><br>
        <br>
        <br>
        <br>
        <br>
        <br>
        <br>
        <br>
        
        <center><H9 id="Algoritmos de la IA"><h1>Algoritmos de la IA</h1></H9></center>
        <hr>

       <p><blockquote>
        Sintetizando se puede decir que los algoritmos son instrucciones paso a paso que ayudan a un ordenador a completar un c&aacute;lculo. De esta manera, la Inteligencia Artificial 
        utiliza algoritmos para crear m&aacute;quinas que aprendan de su propia experiencia, se reconfiguran ante 
        nuevos escenarios y desarrollan las tareas de manera similar a c&oacute;mo lo har&iacute;amos nosotros.<br>
        <br>

        Para crear Inteligencia Artificial hay dos fundamentos b&aacute;sicos de los que se valen: los algoritmos y los datos para configurarlos. El algoritmo proporciona las instrucciones 
        para la m&aacute;quina y los datos permiten a la m&aacute;quina aprender a emplear esas instrucciones y perfeccionar su uso.<br>
        <br>

        Seg&uacute;n la disposici&oacute;n de las instrucciones se puede hablar de distintos tipos de Inteligencia Artificial y del algoritmo de Inteligencia Artificial, destacamos los siguientes:<br>
        <br>
        <ul>
            <li>Los tipos de algoritmos en Inteligencia Artificial que emplean la l&oacute;gica, crean algoritmos bas&aacute;ndose en los principios racionales del pensamiento humano.<br>
                <br>

            <li>Los tipos de algoritmos en Inteligencia Artificial que combinan l&oacute;gica e intuici&oacute;n (<A href="https://www.sas.com/es_es/insights/analytics/deep-learning.html">Deep Learning</A>), 
                los algoritmos se dise&ntilde;an como neuronas humanas, empleando el patr&oacute;n de funcionamiento del cerebro de las personas para que la m&aacute;quina aprenda como lo har&iacute;a una persona.<br>
                <br>
        </ul>
        La Inteligencia Artificial y los algoritmos son un superconjunto de tecnolog&iacute;as que engloba al Machine Learning. A continuaci&oacute;n, mencionaremos los principales tipos de 
        algoritmos en Inteligencia Artificial.<br>
        <br>
    <ul>
        
        <li><b>Aprendizaje por refuerzo (RL, Reinforcement Learning)</b><br>
    <blockquote>
            Este tipo de aprendizaje consiste en la interacci&oacute;n constante basada en la “prueba y error” que una máquina puede realizar en tiempo récord en determinadas condiciones o en un 
            entorno dado (en un juego, por ejemplo) y con un objetivo espec&iacute;fico que se denomina “recompensa”. De esta manera, se pueden obtener resultados, patrones, correlaciones, caminos 
            y conclusiones basadas en experiencias previas generadas por la propia m&aacute;quina.<br>
        <br>

            Un ejemplo de este modelo de aprendizaje de algoritmos es la IA ajedrecista AlphaZero de DeepMind. Donde ense&ntilde;as a la m&aacute;quina a jugar una partida introduciendo las 
            reglas en sus sistema, luego le das una recompensa cada vez que consigue su objetivo (por ejemplo, ganar una partida).<br>
        <br>

            Los principales algoritmos utilizados en el aprendizaje por refuerzo son la programaci&oacute;n din&aacute;mica (dynamic programming), Q-Learning y SARSA (State-action-reward-state-action).<br>
        <br>
    </blockquote>

        <li><b>Aprendizaje supervisado (Supervised machine learning)</b><br>
    <blockquote>
            El aprendizaje supervisado emplea modelos predictivos o algoritmos que utilizan datos de entrenamiento. Dado un conjunto de datos, se pretende que el sistema sea capaz de lograr una salida. 
            Con este sistema, el modelo es ajustado (entrenado) hasta conseguir los resultados deseados. Un ejemplo de este aprendizaje es el de los coches aut&oacute;nomos.<br>
        <br>

            Los principales algoritmos en el supervised machine learning son los &aacute;rboles de decisi&oacute;n, clasificaciones Naive Bayes, la regresi&oacute;n ordinaria por m&iacute;nimos de cuadrados, 
            la regresi&oacute;n log&iacute;stica y el Support Vector Machines (SVM).<br>
        <br>
    </blockquote>

        <li><b>Aprendizaje no supervisado (Unsupervised machine learning)</b><br>
    <blockquote>      
            El algoritmo de Inteligencia Artificial de este aprendizaje son similares al del aprendizaje supervisado, sin embargo, estos se ajustan solo en funci&oacute;n de los datos de entrada. Es decir, 
            el algoritmo realiza un auto-entrenamiento sin indicaciones externas. Estos algoritmos están pensados para realizar un procesamiento m&aacute;s complejo.<br>
        <br>

            Los algoritmos m&aacute;s utilizados en el aprendizaje no supervisado son los algoritmos de agrupamiento o clustering, el an&aacute;lisis de componentes principales (PCA), el Singular 
            Value Decomposition (SVD) y el an&aacute;lisis de componentes independientes.<br>
        <br>
    </blockquote>
    </ul>

    <center><H10 id="IA en el los videojuegos"><h1>IA en el los videojuegos</h1></H10></center>
    <hr>

    <p><blockquote>
        A lo largo de los a&tilde;os los videojuegos han ido cambiando y los nuevos avances tecnol&oacute;gicos han provocado que cada vez haya videojuegos m&aacute;s novedosos y que las experiencias del usuario mientras 
        están jugando sean cada vez mejores. <br>
        <br>

        La Inteligencia Artificial es muy llamativa en la actualidad y se están produciendo grandes avances en esta.
        En los videojuegos la inteligencia artificial se clasifica como todas aquellas t&eacute;cnicas que se emplean para dise&ntilde;ar el comportamiento de los personajes controlados por el director de un juego. Pero no solo eso, 
        si no que tambi&eacute;n se emplea para el dise&ntilde;o de mapas, niveles y para la creaci&oacute;n del juego desde cero.<br>
        <br> 
    <ul>
        <li><h2><b>Aplicaci&oacute;n de la inteligencia artificial a videojuegos</b></h2><br>

            En el &aacute;mbito de los videojuegos, el uso de inteligencia artificial se focaliza en la forma de actuar del jugador que controla la m&aacute;quina, ya sea un oponente o un integrante de su propio bando.<br>
            <br>

            Existen ejemplos tradicionales, como el equipo rival en un partido de fútbol, o el adversario en un juego de lucha o una partida de ajedrez. En todos estos casos, el jugador se enfrenta a un contrincante que 
            maneja la propia videoconsola o el ordenador.<br>
            <br>


            Sin embargo, los avances tecnológicos han hecho posible que el campo de acción de la inteligencia artificial se extienda otros ámbitos, por ejemplo:<br>
            <br>
    <ul>
            <li><b>Diseño de mapeado:</b> 
                es el espacio total en el que se mueve el usuario en su intención de completar el objetivo del juego. Se trata de la creación de los niveles del videojuego, ya sean escenarios, fases, misiones…<br>
                <br>

            <li><b>Creación de juegos:</b> 
                existe un propio género, el de los videojuegos procedurales, en el que parte o todo el contenido del juego se construye con algoritmos.<br>
                <br>

            Además, a la hora de hablar de la forma de aplicar la inteligencia artificial a los videojuegos hay que tener en cuenta dos tipos de arquitectura: <br>
            <br>

            <li><b>Centralizada:</b> 
                se desarrolla el producto de arriba a abajo, con un plan de acción general y las órdenes que desarrollan ese plan. Es la opción habitual en los juegos de estrategia o de tablero.<br>
                <br>

            <li><b>Distribuida:</b> 
                se desarrolla de abajo a arriba, y se aplica la inteligencia artificial de manera específica e independiente a una unidad del juego (robot, personaje, etc.). Este modelo es típico de los juegos en primera persona o de deportes.<br>
                <br>
            </blockquote></p>

            <center><img src="https://isopixel.net/wp-content/uploads/2023/06/videojuegos-e-inteligencia-artificial.webp" height="500" width="1000"></center><br>
            <br>


          <blockquote><p>
        </ul>  
            Al crear un videojuego son muchas las técnicas utilizadas para la creación de entorno, personajes y otros elementos significativos.<br>
            <br>

            Los métodos más frecuentes de IA en videojuegos es la de NPC, conocido como “Personaje No Jugador”.  Se trata de un término utilizado para describir a aquellos personajes involucrados dentro del videojuegos que no son controlables por el propio jugador, sino 
            por el videojuego en sí.<br>
            <br>

            Normalmente forma parte de la trama del juego, en función de las decisiones del jugador con respecto a los NPCs en videojuegos pueden tener unas consecuencias u otras.<br>
            <br>

            Los NPCs en videojuegos son controlados mediante árboles de decisión. Estos árboles trabajan con un algoritmo donde se tienen en cuenta todos los movimientos, ya sean en el momento o futuros, así como la rama de opciones para elegir la mejor de ellas.<br>
            <br>

            Se programan, por tanto, los diferentes eventos a los que se enfrenta el NPC y cuáles serían sus posibles reacciones.<br>
            <br>

            Para elegir el mejor camino para trasladarse de un punto a otro teniendo en cuenta el entorno y los diferentes obstáculos se utiliza la búsqueda de ruta. Esta técnica es utilizada para movimiento de jugadores de forma automático y para NPCs.<br>
            <br>
        
    </ul>
    </blockquote></p>

      <ul>
      <li><h2><b>Caracter&iacute;sticas de los videojuegos con inteligencia artificial </b></h2><br>
    
      <p><blockquote>
        La característica fundamental de la inteligencia artificial en videojuegos es que cumple una función lúdica, nos sirve como entretenimiento dentro del propio juego. Esto hace que sea diferente a la IA en otros campos, la IA en videojuegos no tiene una aplicación práctica 
        en la vida real.<br>
        <br>

        Esto hace que los videojuegos sean un campo ideal para experimentar con nuevas técnicas e ideas que tengan que ver con las aplicaciones de la inteligencia artificial. En el caso que nos ocupa, los avances de la IA en este medio han permitido que se puedan llegar a 
        desarrollar juegos completos solo con los datos que maneja en el momento.<br>
        <br>

        La inteligencia artificial en videojuegos es algo que ya existe desde sus inicios. Uno de los primeros ejemplos de ello es el Pong, donde el rival virtual era capaz de moverse con base en el movimiento de la bola.<br>
        <br>

        El enfoque lúdico de la IA en videojuegos tiene otra característica que la hace diferente respecto a otros campos. Para medicina, para derecho, para finanzas, la IA se diseña de tal forma que sea lo más eficiente posible. Ahora imagina que en un videojuego tienes enemigos 
        que te aciertan un disparo desde 2km de distancia. Eso elevaría mucho la dificultad de los juegos y rompería totalmente la inmersión que se pretende conseguir.<br>
        <br>

        Por eso, el objetivo fundamental del desarrollo de la inteligencia artificial en videojuegos es hacer que los NPC tengan un comportamiento más humano, no más perfecto.<br>
        <br>
        Algunas de las características presentes en los videojuegos que utilizan inteligencia artificial son las siguientes:<br>
        <br>

        <b>Grado de dificultad:</b> 
        es recomendable ajustar el nivel con el que la inteligencia artificial se enfrenta al jugador, puesto que cada videojuego cuenta con su propia curva de aprendizaje, que condiciona el tiempo que le llevará al jugador adaptarse a la dificultad demandada en cada nivel.<br>
        <br>

        <b>Información oculta:</b> 
        se trata de evitar que el jugador sepa de manera prematura aspectos tan relevantes como partes secretas de un mapa o datos que no debe conocer hasta lograr ciertos objetivos.<br>
        <br>
        
        <b>Actualización en tiempo real:</b> 
        generalmente, la inteligencia artificial se ejecuta en los momentos menos complejos del videojuego para evitar bloquear el desarrollo principal de la trama.<br>
        <br>
    </ul>
      </blockquote></p>

      <center><img src="https://www.inesdi.com/sites/default/files/2022-07/todo%20sobre%20la%20IA%20en%20videojuegos.jpg" width="800" height="500"></center><br>
      <br>

      <img src="https://assets.entrepreneur.com/content/3x2/2000/1679524917-GettyImages-1205770978.jpg" width="600" height="400" align="LEFT">

      <img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ_94xHh1rZNViZBrrkOr328P1LiXFFANoMSA&usqp=CAU" width="600" height="400" align="RIGHT"><br>
      <br>
      <BR>
      <BR>
        <BR>
            <BR>
                <BR>
                    <BR>
                        <BR>
                            <BR>
                                <BR>
                                    <BR>
                                        <BR>
                                     <BR>
                                 <BR>
                              <BR>
                          <BR>
                       <BR>
                    <BR>
                <BR>
            <BR>
        <BR>
    <BR>
<BR>
    
   </blockquote></p>

    <p><blockquote>
        <ul>
            <li><h2><b>La importancia de la inteligencia artificial en el mundo del ajedrez</b></h2><BR>
                <BR>
        </UL>

        Un ejemlplo de la IA en los videojuegos es el ajedrez, en el ajedrez, la inteligencia artificial y los motores de ajedrez juegan un papel significativo al ayudar a los jugadores a analizar y mejorar sus movimientos.<br>
        <br>

        La IA es fundamental en los motores de ajedrez porque permite que la computadora evalúe posiciones y tome decisiones informadas basadas en su análisis. Los motores de ajedrez utilizan diversos algoritmos y técnicas, 
        incluido el aprendizaje automático, para evaluar posiciones y realizar el próximo movimiento. Lo hacen analizando grandes cantidades de datos para obtener elecciones de posición muy sólidas y precisas, lo que les 
        permite jugar mucho más rápido que un ser humano. Esto lo convierte en una herramienta valiosa para los jugadores de ajedrez que desean estudiar y mejorar su juego. Mejor aún, los motores de ajedrez también pueden 
        funcionar a niveles profesionales, lo que los convierte en un oponente desafiante incluso para los jugadores humanos más fuertes. Entonces, ¿cómo funciona exactamente la IA detrás de los motores de ajedrez?<br>
        <br>

        Los motores de ajedrez evalúan los mejores movimientos utilizando varios potentes algoritmos y técnicas de inteligencia artificial, incluyendo:<br>
        <br>

        <b>Algoritmos de búsqueda:</b> <br>
        <br>
        <blockquote>
        Algoritmos utilizados para buscar entre la vasta cantidad de movimientos y posiciones posibles en un turno dado. Analizan la posición actual, generan todos los movimientos posibles y luego evalúan 
        cada posición resultante para determinar cuál movimiento conduce al mejor resultado.<br>
        <br>
        </blockquote>
        
        <b>Funciones de evaluación:</b><br>
        <br>
    <blockquote>
        Funciones que pueden evaluar la fortaleza de una posición dada. Toman en cuenta factores como el equilibrio material, la estructura de peones, la movilidad, la seguridad del rey, el control de casillas 
        clave, entre otros. La función de evaluación proporciona un puntaje numérico para una posición dada, que el algoritmo de búsqueda utiliza para determinar el mejor movimiento.<br>
        <br>
    </blockquote>
        
        <b>Bases de datos de finales de juego:</b><br>
        <br>
    <blockquote>
        Bases de datos precalculadas que permiten a los motores de ajedrez jugar posiciones perfectas de finales de juego. Cuando el motor detecta que una posición es un final de juego, puede utilizar 
        esta base de datos para determinar los mejores movimientos.<br>
        <br>
    </blockquote>
        
        <b>Técnicas de machine learning:</b><br> 
        <br>
    <blockquote>
        Técnicas utilizadas para mejorar las funciones de evaluación de los motores de ajedrez. Pueden aprender de los resultados de partidas anteriores para mejorar su comprensión de posiciones buenas y malas 
        y ajustar el peso de varios factores en la función de evaluación.<br>
        <br>
    </blockquote>

    <CENTER><IMG SRC="https://images.chesscomfiles.com/uploads/v1/images_users/tiny_mce/SamCopeland/phpuTejFE.gif" width="700" height="700" ><BR></CENTER>
        <BR>
            <BR>
        <p><blockquote>
        En términos de estrategia, los motores de ajedrez pueden programarse para jugar en diversos estilos según las preferencias del programador o del usuario. Por ejemplo, algunos motores pueden estar diseñados para jugar de manera 
        agresiva y priorizar el ataque al rey del oponente, mientras que otros pueden estar diseñados para jugar de manera más cautelosa y priorizar la ventaja material y la seguridad del propio rey. La elección de la estrategia dependerá a 
        menudo de la función de evaluación y el peso asignado a diversos factores.<br>
        <br>

        Los motores de ajedrez más famosos y respetados hasta ahora utilizan una combinación de algoritmos de búsqueda, funciones de evaluación, tablas de finales y aprendizaje automático para evaluar los mejores movimientos y decidir su 
        estrategia. La calidad y fortaleza de un motor de ajedrez dependerán de la sofisticación de estos algoritmos y técnicas, junto con la precisión de la función de evaluación.<br>
        <br>

        Ahora analizaremos brevemente tres de los motores de ajedrez más famosos.<br>
        <br>
        <ul>
            <li><h2><B>Stockfish</B></h2><BR>
            <BR>
        <blockquote>
        <UL>
            <A HREF="https://es.wikipedia.org/wiki/Stockfish">Stockfish</A> es un motor de ajedrez de código abierto y compatible con UCI (que significa Interfaz Universal de Ajedrez, un protocolo para comunicarse con motores de ajedrez de 
            manera estandarizada) que es ampliamente reconocido como uno de los motores de ajedrez más fuertes del mundo. Está escrito en C++ y está diseñado para funcionar en diversas plataformas, incluyendo Windows, Mac y Linux.<BR>
             <BR>

            En cuanto a su fortaleza, Stockfish es conocido por su capacidad para analizar minuciosamente y de manera precisa las posiciones. Como resultado, ha sido consistentemente clasificado en la cima de las clasificaciones de ajedrez 
            por computadora y ha ganado varios campeonatos de ajedrez por computadora.<BR>
            <BR>

        </UL>
        </blockquote>
        </blockquote></p>

        <p><blockquote>
        <center><table border cellpadding="10">
            <tr>
                <th bgcolor="#FFFF00">combinaci&oacute;n</th>
                <th bgcolor="#FFFF00">Funci&oacute;n</th>
            </tr>

            <tr>
                <td bgcolor="#CCCCCC"><b>Alpha-Beta Pruning:</b></td>
                <td bgcolor="#CCCCCC">Un algoritmo de búsqueda que reduce la cantidad de nodos en el árbol de búsqueda al podar las ramas que es poco probable que contengan el mejor movimiento. Esto permite que el motor busque 
                    las diferentes opciones de movimiento al mismo tiempo.</td>
            </tr>

            <tr>
                <td bgcolor="#CCCCCC"><b>Quiescence Search:</b></td>
                <td bgcolor="#CCCCCC">Una extensión de la búsqueda alfa-beta que aborda el problema de las posiciones tácticas. Cuando se encuentran en estos escenarios, los movimientos silenciosos (o movimientos que no capturan material) pueden no ser lo suficientemente 
                    buenos para evitar futuras posiciones tácticas de manera precisa, por lo que el motor necesita continuar buscando posibles movimientos tácticos que podrían seguir hasta que la posición esté, sin lugar a dudas, verdaderamente tranquila.</td>
            </tr>

            <tr>
                <td bgcolor="#CCCCCC"><b>Null Move Pruning:</b></td>
                <td bgcolor="#CCCCCC">Una técnica que permite al motor identificar rápidamente posiciones en las que un bando no tiene movimientos útiles. En estas posiciones, el motor simplemente pasa el movimiento al oponente, lo que le permite examinar mejor las opciones de 
                    movimiento en un tiempo más corto.</td>
            </tr>

            <tr>
                <td bgcolor="#CCCCCC"><b>Multi-Threading:</b></td>
                <td bgcolor="#CCCCCC">Un algoritmo diseñado para aprovechar los procesadores de múltiples núcleos, donde cada núcleo maneja una porción separada del árbol de búsqueda. Esto permite que el motor busque más rápido y analice más posiciones en un tiempo determinado.</td>
            </tr>
        
        </table></center><BR>
            <BR>
            </p></blockquote>
           
            <center>
            <IMG SRC="https://images.chesscomfiles.com/uploads/v1/images_users/tiny_mce/ColinStapczynski/phpbfcVWG.jpeg" width="600" height="400" align="right"><br>
                <br>

            <img src="https://hips.hearstapps.com/hmg-prod/images/feb-20-2020-14-08-15-1582225643.gif" width="600" height="400" align="left"><br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br></center>

           
            <p><blockquote>
           Podemos etiquetar a Stockfish como un «motor de ajedrez tradicional», que se entrena utilizando grandes bases de datos de partidas de grandes maestros para guiar su evaluación y toma de decisiones a través de las estrategias de IA mencionadas anteriormente.<BR>
            <BR>
            </blockquote></p>
                
            <p><blockquote>
            <ul>
                    <li><h2><b>AlphaZero</b></h2><br>
                  <p><blockquote>
                      <A href="https://es.wikipedia.org/wiki/AlphaZero">AlphaZero</A> es un motor de ajedrez desarrollado por DeepMind, una compañía de investigación en inteligencia artificial adquirida por Google.<br>
                      <br>
      
                      Escrito en C++ y Python y no disponible públicamente, AlphaZero se hizo famoso por su rápida maestría del juego después de sólo unas pocas horas de entrenamiento autodidacta.<br>
                      <br>
      
                      Utiliza una combinación de redes neuronales profundas y búsqueda de árboles Monte Carlo (MCTS) para jugar ajedrez. Las redes neuronales se entrenan para evaluar posiciones y predecir el mejor movimiento a 
                      realizar, mientras que el algoritmo MCTS se utiliza para buscar el mejor movimiento al simular muchos juegos aleatorios desde una posición dada. Las redes neuronales y los algoritmos MCTS se entrenan juntos, 
                      lo que permite a AlphaZero mejorar tanto su capacidad para examinar posiciones como sus capacidades de búsqueda.<br>
                      <br>
                  </blockquote></p>
                  </ul>

                  <MAP NAME="AlphaZero">
                    <AREA SHAPE="RECT" COORDS="1376,1399,220,191" HREF="https://es.wikipedia.org/wiki/AlphaZero">
                    <AREA SHAPE="DEFAULT" NOHREF>
                    </MAP>
                    <CENTER><IMG SRC="https://media.newyorker.com/photos/5c24f47dd2db9849ec9e47be/master/w_1600%2Cc_limit/Somers-AlphaZero-Secondary.jpg" width="600" height="500" USEMAP="#AlphaZero"></CENTER><br>
                    <br>
                
                    <p><blockquote>
                <ul>
                    <li><h2><b>Leela Chess Zero</b></h2>
                    <blockquote>
                    <A href="https://es.wikipedia.org/wiki/Leela_Chess_Zero"> Leela Chess Zero </A>(LC0) es un motor de ajedrez de Open Source basado en inteligencia artificial que utiliza los principios del Deep Learning y el reinforcement learning. Fue inspirado por AlphaZero.<br>
                    <br>

                    LC0 está escrito en una combinación de C++ y CUDA, una plataforma de computación paralela e interfaz de programación de aplicaciones (API) para utilizar unidades de procesamiento gráfico (GPU) en cálculos de propósito general.<br>
                    <br>

                    LC0 utiliza redes neuronales para evaluar posiciones y tomar decisiones. Las redes neuronales se entrenan mediante un proceso de autojuego, donde el motor juega partidas contra sí mismo y ajusta sus parámetros en función del 
                    resultado de esas partidas. Esto permite que LC0 mejore con el tiempo y se convierta en un jugador de ajedrez más fuerte. El proceso de autojuego y aprendizaje por refuerzo se implementa utilizando una variedad de algoritmos, 
                    incluida la Búsqueda de Árbol Monte Carlo (MCTS) y el aprendizaje de diferencia temporal.<br>
                    <br>
                    </blockquote>
                </ul>
                    </blockquote></p>

                    <MAP NAME="Leela Chess Zero">
                        <AREA SHAPE="circle" COORDS="322,178,211" HREF="https://es.wikipedia.org/wiki/Leela_Chess_Zero">
                        <AREA SHAPE="DEFAULT" NOHREF>
                        </MAP>
                        <IMG SRC="https://lczero.org/blog/2018/09/leela-chess-zero-difficult-positions/cover.png" width="600" height="300" align="left" USEMAP="#Leela Chess Zero"><br>

                            <MAP NAME="Leela Chess Zero">
                                <AREA SHAPE="circle" COORDS="39,34,598,298" HREF="https://es.wikipedia.org/wiki/Leela_Chess_Zero">
                                <AREA SHAPE="DEFAULT" NOHREF>
                                </MAP>
                                <IMG SRC="https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Leela_Chess_Zero_logo.svg/640px-Leela_Chess_Zero_logo.svg.png" width="600" height="300" align="right" USEMAP="#Leela Chess Zero"><br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
    </blockquote></p>

            <center><H11 id="El papel de la inteligencia artificial en la lucha contra el cambio climático"><h1>El papel de la inteligencia artificial en la lucha contra el cambio climático</h1></H11></center>
            <hr>

            <p><blockquote>
                Esta coalición de estamentos tiene entre sus objetivos la promoción de la innovación, la actuación como plataforma global para la identificación de herramientas y usos de la 
                inteligencia artificial (IA) para solucionar la crisis climática, el aseguramiento de su impacto a gran escala, y la facilitación del desarrollo de otras alianzas tanto públicas como privadas.<br>
                <br>
                La analítica avanzada y la IA son herramientas que se encuentran en una posición única para ayudar a gestionar cuestiones complejas. En una encuesta mundial realizada por BCG en mayo a más de mil 
                líderes del sector público y privado en materia de clima e inteligencia artificial, el 87% afirmaron que ven la inteligencia artificial como una herramienta útil en la lucha contra el cambio climático.<br>
                <br>

                Tal y como se explica en el informe, la coalición se encuentra en búsqueda de equipos e ideas que tengan el poder de alterar la crisis climática y marcar una diferencia significativa mediante el uso 
                de la analítica avanzada y la IA, para lo cual han realizado su primera convocatoria de soluciones que analizará propuestas en cualquier fase de madurez y de cualquier sector, tanto si provienen del 
                sector privado, público, académico o sin ánimo de lucro.<br>
                <br>

                <b>Las tres áreas de aplicación de la IA</b><br>
                <br>

                Gracias a la especial capacidad de la IA para recopilar, completar e interpretar grandes y complejos conjuntos de datos sobre emisiones, impacto climático, etc., esta tecnología puede utilizarse 
                para ayudar a todas las partes interesadas a adoptar un enfoque más informado y basado en datos para reducir las emisiones de carbono y construir una sociedad más ecológica y, a la vez, también 
                puede emplearse para ayudar a reajustar los esfuerzos climáticos globales hacia las regiones de mayor riesgo.<br>
                <br>

                El informe del BCG considera que hay tres áreas de aplicación de la IA que son especialmente relevantes: mitigación, adaptación y resiliencia, y análisis de sus fundamentos.<br>
                <br>

                Así, la IA puede emplearse para ayudar a mitigar la crisis climática a través de la medición de las emisiones tanto a nivel macro como micro, de la reducción de las emisiones y los efectos de los gases de efecto invernadero (GEI), 
                y de la eliminación de las emisiones existentes en la atmósfera.<br>
                <br>

                Según la experiencia de BCG, la IA puede utilizarse para ayudar a reducir las emisiones de GEI en una cantidad equivalente al 5% o el 10% de la huella de carbono de una organización, o un total de 2,6 a 5,3 
                gigatoneladas de dióxido de carbono equivalente (CO2e) si se amplía globalmente.<br>
                <br>

                También, la IA puede aplicarse para potenciar la capacidad de adaptación y resiliencia, en parte mediante la mejora de las proyecciones de los efectos regionales a largo plazo (como el aumento del nivel del mar)
                 o de los fenómenos extremos (como los huracanes o las sequías).<br>
                 <br>

                Estos esfuerzos también incluyen la gestión de la vulnerabilidad y la exposición, mediante el desarrollo de infraestructuras que minimicen el impacto de los riesgos climáticos.zbr <br>
                <br>

                Por último, la IA puede ayudar a analizar los fundamentos del cambio climático, reforzando la investigación y los modelos climáticos, la financiación y el análisis del clima, y la educación, 
                el asesoramiento y el cambio de comportamiento (por ejemplo, en forma de recomendaciones de compras respetuosas con el medio ambiente).<br>
                <br>

                Dentro de cada uno de los anteriores usos, la IA puede emplearse como parte de cinco tareas clave: reunir y completar conjuntos de datos complejos sobre emisiones, impacto climático y 
                proyecciones futuras; reforzar la planificación y la toma de decisiones; optimizar los procesos; apoyar los ecosistemas de 
                colaboración, y fomentar comportamientos positivos para el clima.<br>
                <br>
            </blockquote></p>

            <center><img src="https://hazrevista.org/wp-content/uploads/2022/10/inteligencia-artificial-cambio-clima%CC%81tico.jpg" width="700" height="500"></center>

            <p><blockquote>
                <ul>
                    <li><h2><b>&#191;Qu&eacute; va a hacer falta para que la IA sea adoptada para estas labores?</b></h2><br>
                        <br>
                
                Según BCG, la facilidad de uso es fundamental para que las soluciones de IA se adopten de forma generalizada, independientemente de que se desarrollen para empresas, gobiernos o el público en general.<br>
                <br>

                Estas soluciones deben ser fácilmente accesibles, ofrecer beneficios tangibles al usuario y proporcionar información clara para guiar sus acciones.<br>
                <br>

                Incluso entre los líderes de los sectores público y privado que se dedican a temas relacionados con el clima o la IA, el 78% afirma que la falta de experiencia en IA es un claro obstáculo para los esfuerzos de su 
                organización por utilizarla para combatir el cambio climático. El 77% culpa a la falta de soluciones de IA y el 67% señala la falta de confianza en los datos y análisis relacionados con la IA.<br>
                <br>

                En línea con lo anterior, en el informe se detallan las tres necesidades ineludibles para lograr el éxito de la inteligencia artificial en la lucha contra el cambio climático:<br>
                <br>
             <ul>
                <li><b>Desarrollo de capacidades:</b>
                <blockquote>
                 La formación y el reciclaje pueden garantizar que los funcionarios, los líderes del sector privado y otras partes interesadas utilicen e interpreten las soluciones de IA de forma
                eficaz en contextos críticos. La voluntad de superar el bloqueo de los proveedores también es esencial para garantizar que los usuarios puedan desplegar soluciones prometedoras a gran escala.<br>
                <br>
                </blockquote>
            
                <li><b>Recursos y redes:</b> 
                <blockquote>
                El apoyo financiero puede salvar la brecha entre la investigación académica y el despliegue a escala, y las conexiones con los responsables políticos y los líderes empresariales 
                pueden ayudar a impulsar la concienciación y la adopción. Además, el intercambio de conocimientos sobre las mejores prácticas y las aplicaciones prometedoras puede ayudar a garantizar que las 
                soluciones estén preparadas para su despliegue a escala gubernamental y empresarial.<br>
                <br>
                </blockquote>

                <li><b>Confianza y seguridad:</b> 
                <blockquote>
                Dada la complejidad de la IA y los riesgos asociados de sesgo o comportamiento poco ético, ya sea intencionado o no, los usuarios de la IA deben ganarse la confianza de 
                los líderes. Para ello, deben centrarse en aspectos clave como la calidad y la granularidad de los datos subyacentes y la interpretabilidad del análisis realizado.<br>
                 <br>
                </blockquote>
            </ul>

                Y es que, a pesar de su promesa, la IA no puede utilizarse para resolver la crisis climática de forma aislada. Al contrario, es una de las muchas herramientas esenciales para abordar este reto global.<br>
                <br>

                Los individuos, las comunidades y las organizaciones comprometidas con la lucha contra la crisis climática deberían, por tanto, considerar cómo pueden ayudar otras tecnologías establecidas y emergentes, y deberían 
                ayudar también a eliminar los obstáculos para la ampliación de esas tecnologías.<br>
                <br>
            </ul>
            </blockquote></p>


            <center><H12 id="Qué has aprendido"><h1>&#191;Qu&eacute; has aprendido ?</h1></H12>
                <hr></center><br>
                <br>

                <p><blockquote>
                    <center><h3><b>En base a todo lo anterior podras responder este formulario, espero y hayas aprendido algo, buena suerte.</h3></b></center>
                </blockquote></p>


    <center><p><blockquote>
        <FORM ACTION="mailto:justin.ortiz3677@alumnos.udg.mx" METHOD="POST" ENCTYPE="TEXT/PLAIN">
           <p>Escribe tu apellido:</p>
           <BR>
           <INPUT TYPE="text" NAME="Apellido" SIZE="15" MAXLENGTH="12"><br>
           <br>

           <p>Escribe tu nombre:</p>
           <BR>
           <INPUT TYPE="text" NAME="Nombre" SIZE="15" MAXLENGTH="12"><br>
           <br>

           <P>&#191;Cu&aacute;l es tu correo electronico?</P>
           <INPUT TYPE="text" NAME="Correo electronico" SIZE="15" MAXLENGTH="40"><br>

           <p>&#191;Qu&eacute; es la IA?</p>
           <textarea NAME="Que es?" ROWS="6" COLS="40"></textarea><br>

           <p>&#191;Qu&eacute; tipos de IA recuerdas que existen?</p>
           <SELECT NAME="Tipos IA" multiplesize="4">
               <OPTION SELECTED>
               <OPTION>ANI
               <OPTION>Xbox
               <OPTION>PS
               <OPTION>ASI
               <option>SEGA
               <option>AGI
               <option>Autoconciencia
               </SELECT>
               <br>

            <p>&#191;Qu&eacute; ventaja para ti fue m&aacute;s relevante?</p>
            <textarea NAME="Ventaja" ROWS="6" COLS="40"></textarea><br>

            <p>&#191;Qu&eacute; desventaja para ti fue m&aacute;s relevante?</p>
            <textarea NAME="Desventaja" ROWS="6" COLS="40"></textarea><br>

            <p>&#191;C&uacute;les de estos personajes formaron parte de la historia en la IA?</p>
           <SELECT NAME="Tipos IA" multiplesize="3">
               <OPTION SELECTED>
               <OPTION>Barack Obama
               <OPTION>Steve Jobs
               <OPTION>Alan turing
               <OPTION>Bill Gates
               <option>Stuart Russell
               <OPTION>Patrick Winston
               </SELECT>
               <br>
            
               <p>&#191;Recuerdas alguna caracteristica de las mencionadas? si la recuerdas compartela</p>
               <textarea NAME="Desventaja" ROWS="6" COLS="40"></textarea><br>

               <p>&#191;Qu&eacute; ejemplos te agradaron m&aacute;s?</p>
               <textarea NAME="Desventaja" ROWS="6" COLS="40"></textarea><br>

               <p>&#191;Consideras que la IA puede ayudar en el cambio climatico?&#191;Porque?</p>
               <textarea NAME="Desventaja" ROWS="6" COLS="40"></textarea><br>

               <p>Eso a sido todo, te agradeceria si nos puedes compartir tu opinion sobre este trabajo.<br>
               Muchas gracias, te deseamos lo mejor.
               </p>
               <textarea NAME="Desventaja" ROWS="6" COLS="40"></textarea><br>

           <input type="submit" value="enviar mensaje>">
       </FORM>
    </blockquote></p></center>
</body>
</HTML>