<HTML>
<HEAD>
<TITLE> DATOS SOBRE LA IA </TITLE>
</HEAD>
<BODY >

 <CENTER><H1>Cosas que mo sabias sobre la IA</H1></CENTER>
 <P><blockquote>
    1997: El supercomputador Deep Blue de IBM gan&oacute; al campe&oacute;n mundial de ajedrez Gari Kasparov, y es uno de los momentos clave en la salida de la IA de los laboratorios y centros de 
    investigaci&oacute;n para entrar en lo cotidiano.<BR>
    <BR>
    2011: Otro supercomputador de IBM, Watson, gana un concurso televisivo de Estados Unidos frente a los dos grandes finalistas humanos del programa. Watson acumula informaci&oacute;n a medida que el programa evoluciona ya que 
    puede interactuar con el lenguaje humano. El producto est&aacute; desde entonces accesible desde la nube y diferentes entidades trabajan con &eacute;l.<BR>
    En este mismo a&ntilde;o Apple presenta su asistente virtual Siri integrado en el tel&eacute;fono m&oacute;vil iPhone 4S. <BR>
    <BR>
    2012: Fue un a&ntilde;o clave de la segunda generaci&oacute;n de inteligencia artificial, con el lanzamiento de asistentes virtuales de las compa&ntilde;&iacute;as Google y Microsoft.<BR>
    <BR>
    2016: El software Alpha Go, de Google se enfrent&oacute; al surcoreano Se-Dol, campe&oacute;n mundial de Go, un juego de estrategia complejo, en una partida a cinco juegos. Alpha Go gan&oacute; la mayor&iacute;a de juegos.<BR>
    <BR>
    2017: Telef&oacute;nica present&oacute; una plataforma de capacidades cognitivas para relacionarse con sus clientes a trav&eacute;s de Aura. Inici&oacute; así una nueva etapa, convirti&eacute;ndose en la primera compañ&iacute;a 
    del sector que brinda a sus clientes la posibilidad de gestionar, de una forma natural, su relaci&oacute;n con la compa&ntilde;&iacute;a gracias a la inteligencia artificial.<BR>
    En ese mismo a&ntilde;o la Universidad Carnegie Mellon desarrolla el algoritmo Libratus que venci&oacute; claramente a cuatro de los mejores jugadores profesionales de póquer en un Casino de Estados Unidos.<BR>
    <BR>
    2019: Se desarrollan nuevos desarrollos para la industria del turismo, la movilidad y la banca que utilizan algoritmos de reconocimiento de imagen y modelos predictivos sobre el comportamiento de las personas.<BR>
    <BR>
    2021: Los expertos auguran que la IA generará m&aacute;s de 300 mil millones de d&oacute;lares anuales de negocio en todo a lo largo del a&ntilde;o 2024.<BR>
    <BR>
    
    <CENTER><IMG SRC="https://imagenes.elpais.com/resizer/oqFZr3YGZOiraP7RgHo9PfaoY9A=/1960x1470/cloudfront-eu-central-1.images.arcpublishing.com/prisa/VTS3XGVEJAY4FO7YKTLVGMTCIQ.gif" width="800" height="600"></CENTER>
     <BR>
    <CENTER><A href="file:///D:/Web/A6-UC1-JAOP.html"><b>Pagina inicial: Inteligencia Artificial</b></A></CENTER>
     
    </blockquote></P>
</BODY>
</HTML>

