<HTML>
<head>
<title> Aplicaciones pr&aacute;cticas de la Inteligencia Artificial</title>
</head>
<body bgcolor="#FFFF77">
<center><H1> Cuales son las principales aplcaciones de la inteligencia artificial1 </H1></center>
<p><blockquote>
    Los avances en IA ya est&Aacute;n impulsando el uso del <A href="https://www.iberdrola.com/innovacion/que-es-para-que-sirve-big-data">big data</A> 
    debido a su habilidad para procesar ingentes cantidades de datos y proporcionar ventajas comunicacionales, comerciales y empresariales que la han llevado 
    a posicionarse como la tecnolog&Iacute;a esencial de las pr&oacute;ximas d&eacute;cadas. Transporte, educaci&oacute;n, sanidad, cultura...
    ning&uacute;n sector se resistir&aacute; a sus encantos.<BR>
    <BR>

    <ul>
       <LI>Asistentes personales virtuales<BR>
        Conviviremos con chatbots interactivos que podr&aacute;n sugerirnos productos, restaurantes, hoteles, servicios, espect&aacute;culos, 
        seg&uacute;n nuestro historial de b&uacute;squedas.<BR>
            <BR>
            <CENTER><IMG SRC="https://www.pcfusion.com.mx/wp-content/uploads/2022/03/asistentes-personales-digitales-pc-fusio%CC%81n.jpg" width="1500" height="600" ></CENTER> 
        
       <LI>Clim&aacute;ticas<BR>
            Flotas de drones capaces de plantar mil millones de &aacute;rboles al a&ntilde;o para combatir la deforestaci&oacute;n, veh&iacute;culos
            submarinos no tripulados para detectar fugas en oleoductos, edif&iacute;cios inteligentes dise&ntilde;ados para reducir el consumo energ&eacute;tico, etc.<BR>
        <BR>
            <IMG SRC="https://mundoenlinea.cl/wp-content/uploads/2020/01/Renovable-3-678x381.jpg" width="800" height="600" alig >
        
        <LI>Agricolas<BR>
            Plataformas espec&iacute;f&iacute;cas que, por medio de an&aacute;lisis predictivos, mejoran los rendimientos agr&iacute;colas y advierten de impactos ambientales
             adversos.<BR>
            <BR>
         <IMG SRC="https://energiahoy.com/wp-content/uploads/2021/02/Agricultura--870x596.jpg" width="800" height="600" >
        
      <LI>Finanzas<BR>
            Las tecnolog&iacute;as inteligentes pueden ayudar a los bancos a detectar el fraude, predecir patrones del mercado y aconsejar operaciones
            a sus clientes.<BR>
                <br>
            <IMG SRC="https://s03.s3c.es/imag/_v0/770x420/e/a/4/robot-trading-dreamstime.jpg" width="800" height="600" >

        <Li> Educaci&oacute;n<br>
            Permite saber si un estudiante est&aacute; a punto de cancelar su registro, sugerir nuevos cursos o crear ofertas personalizadas para 
            optimizar el aprendizaje.<br>
            <br>
            <img src="https://www.sciencenews.org/wp-content/uploads/2023/04/040823_chatgpt_feat.gif" width="800" height="600">

        <li>Sanidad<br>
            Ya existen chatbots que nos preguntan por nuestros s&iacute;ntomas para realizar un diagn&oacute;stico. La recolecci&oacute;n de datos genera patrones 
            que ayudan a identif&iacute;car factores gen&eacute;ticos susceptibles de desarrollar una enfermedad. <br>
            <br>
            <img src="https://elglobal.es/wp-content/uploads/2021/10/GettyImages-1302357458.jpg" width="800" height="600"><br>
            <br>

        <li> <center><a href="file:///D:/Web/A6-UC1-JAOP.html"><b>Pagina inicial: Intligencia artificial</b></a></center><br>
            <br>

    </ul>
   
</p></blockquote>

</body>
</html> 